GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
DMAnAIRQ                                 equ 00FEh
// bitfield definitions
DMAnAIRQ_AIRQ_POSN                       equ 0000h
DMAnAIRQ_AIRQ_POSITION                   equ 0000h
DMAnAIRQ_AIRQ_SIZE                       equ 0008h
DMAnAIRQ_AIRQ_LENGTH                     equ 0008h
DMAnAIRQ_AIRQ_MASK                       equ 00FFh
DMAnAIRQ_AIRQ0_POSN                      equ 0000h
DMAnAIRQ_AIRQ0_POSITION                  equ 0000h
DMAnAIRQ_AIRQ0_SIZE                      equ 0001h
DMAnAIRQ_AIRQ0_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ0_MASK                      equ 0001h
DMAnAIRQ_AIRQ1_POSN                      equ 0001h
DMAnAIRQ_AIRQ1_POSITION                  equ 0001h
DMAnAIRQ_AIRQ1_SIZE                      equ 0001h
DMAnAIRQ_AIRQ1_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ1_MASK                      equ 0002h
DMAnAIRQ_AIRQ2_POSN                      equ 0002h
DMAnAIRQ_AIRQ2_POSITION                  equ 0002h
DMAnAIRQ_AIRQ2_SIZE                      equ 0001h
DMAnAIRQ_AIRQ2_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ2_MASK                      equ 0004h
DMAnAIRQ_AIRQ3_POSN                      equ 0003h
DMAnAIRQ_AIRQ3_POSITION                  equ 0003h
DMAnAIRQ_AIRQ3_SIZE                      equ 0001h
DMAnAIRQ_AIRQ3_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ3_MASK                      equ 0008h
DMAnAIRQ_AIRQ4_POSN                      equ 0004h
DMAnAIRQ_AIRQ4_POSITION                  equ 0004h
DMAnAIRQ_AIRQ4_SIZE                      equ 0001h
DMAnAIRQ_AIRQ4_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ4_MASK                      equ 0010h
DMAnAIRQ_AIRQ5_POSN                      equ 0005h
DMAnAIRQ_AIRQ5_POSITION                  equ 0005h
DMAnAIRQ_AIRQ5_SIZE                      equ 0001h
DMAnAIRQ_AIRQ5_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ5_MASK                      equ 0020h
DMAnAIRQ_AIRQ6_POSN                      equ 0006h
DMAnAIRQ_AIRQ6_POSITION                  equ 0006h
DMAnAIRQ_AIRQ6_SIZE                      equ 0001h
DMAnAIRQ_AIRQ6_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ6_MASK                      equ 0040h
DMAnAIRQ_AIRQ7_POSN                      equ 0007h
DMAnAIRQ_AIRQ7_POSITION                  equ 0007h
DMAnAIRQ_AIRQ7_SIZE                      equ 0001h
DMAnAIRQ_AIRQ7_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ7_MASK                      equ 0080h

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
DMAnSIRQ                                 equ 00FFh
// bitfield definitions
DMAnSIRQ_SIRQ_POSN                       equ 0000h
DMAnSIRQ_SIRQ_POSITION                   equ 0000h
DMAnSIRQ_SIRQ_SIZE                       equ 0008h
DMAnSIRQ_SIRQ_LENGTH                     equ 0008h
DMAnSIRQ_SIRQ_MASK                       equ 00FFh
DMAnSIRQ_SIRQ0_POSN                      equ 0000h
DMAnSIRQ_SIRQ0_POSITION                  equ 0000h
DMAnSIRQ_SIRQ0_SIZE                      equ 0001h
DMAnSIRQ_SIRQ0_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ0_MASK                      equ 0001h
DMAnSIRQ_SIRQ1_POSN                      equ 0001h
DMAnSIRQ_SIRQ1_POSITION                  equ 0001h
DMAnSIRQ_SIRQ1_SIZE                      equ 0001h
DMAnSIRQ_SIRQ1_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ1_MASK                      equ 0002h
DMAnSIRQ_SIRQ2_POSN                      equ 0002h
DMAnSIRQ_SIRQ2_POSITION                  equ 0002h
DMAnSIRQ_SIRQ2_SIZE                      equ 0001h
DMAnSIRQ_SIRQ2_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ2_MASK                      equ 0004h
DMAnSIRQ_SIRQ3_POSN                      equ 0003h
DMAnSIRQ_SIRQ3_POSITION                  equ 0003h
DMAnSIRQ_SIRQ3_SIZE                      equ 0001h
DMAnSIRQ_SIRQ3_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ3_MASK                      equ 0008h
DMAnSIRQ_SIRQ4_POSN                      equ 0004h
DMAnSIRQ_SIRQ4_POSITION                  equ 0004h
DMAnSIRQ_SIRQ4_SIZE                      equ 0001h
DMAnSIRQ_SIRQ4_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ4_MASK                      equ 0010h
DMAnSIRQ_SIRQ5_POSN                      equ 0005h
DMAnSIRQ_SIRQ5_POSITION                  equ 0005h
DMAnSIRQ_SIRQ5_SIZE                      equ 0001h
DMAnSIRQ_SIRQ5_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ5_MASK                      equ 0020h
DMAnSIRQ_SIRQ6_POSN                      equ 0006h
DMAnSIRQ_SIRQ6_POSITION                  equ 0006h
DMAnSIRQ_SIRQ6_SIZE                      equ 0001h
DMAnSIRQ_SIRQ6_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ6_MASK                      equ 0040h
DMAnSIRQ_SIRQ7_POSN                      equ 0007h
DMAnSIRQ_SIRQ7_POSITION                  equ 0007h
DMAnSIRQ_SIRQ7_SIZE                      equ 0001h
DMAnSIRQ_SIRQ7_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ7_MASK                      equ 0080h

// Register: C1CONL
#define C1CONL C1CONL
C1CONL                                   equ 0100h
// bitfield definitions
C1CONL_DNCNT_POSN                        equ 0000h
C1CONL_DNCNT_POSITION                    equ 0000h
C1CONL_DNCNT_SIZE                        equ 0005h
C1CONL_DNCNT_LENGTH                      equ 0005h
C1CONL_DNCNT_MASK                        equ 001Fh
C1CONL_ISOCRCEN_POSN                     equ 0005h
C1CONL_ISOCRCEN_POSITION                 equ 0005h
C1CONL_ISOCRCEN_SIZE                     equ 0001h
C1CONL_ISOCRCEN_LENGTH                   equ 0001h
C1CONL_ISOCRCEN_MASK                     equ 0020h
C1CONL_PXEDIS_POSN                       equ 0006h
C1CONL_PXEDIS_POSITION                   equ 0006h
C1CONL_PXEDIS_SIZE                       equ 0001h
C1CONL_PXEDIS_LENGTH                     equ 0001h
C1CONL_PXEDIS_MASK                       equ 0040h
C1CONL_CLKSEL0_POSN                      equ 0007h
C1CONL_CLKSEL0_POSITION                  equ 0007h
C1CONL_CLKSEL0_SIZE                      equ 0001h
C1CONL_CLKSEL0_LENGTH                    equ 0001h
C1CONL_CLKSEL0_MASK                      equ 0080h
C1CONL_DNCNT0_POSN                       equ 0000h
C1CONL_DNCNT0_POSITION                   equ 0000h
C1CONL_DNCNT0_SIZE                       equ 0001h
C1CONL_DNCNT0_LENGTH                     equ 0001h
C1CONL_DNCNT0_MASK                       equ 0001h
C1CONL_DNCNT1_POSN                       equ 0001h
C1CONL_DNCNT1_POSITION                   equ 0001h
C1CONL_DNCNT1_SIZE                       equ 0001h
C1CONL_DNCNT1_LENGTH                     equ 0001h
C1CONL_DNCNT1_MASK                       equ 0002h
C1CONL_DNCNT2_POSN                       equ 0002h
C1CONL_DNCNT2_POSITION                   equ 0002h
C1CONL_DNCNT2_SIZE                       equ 0001h
C1CONL_DNCNT2_LENGTH                     equ 0001h
C1CONL_DNCNT2_MASK                       equ 0004h
C1CONL_DNCNT3_POSN                       equ 0003h
C1CONL_DNCNT3_POSITION                   equ 0003h
C1CONL_DNCNT3_SIZE                       equ 0001h
C1CONL_DNCNT3_LENGTH                     equ 0001h
C1CONL_DNCNT3_MASK                       equ 0008h
C1CONL_DNCNT4_POSN                       equ 0004h
C1CONL_DNCNT4_POSITION                   equ 0004h
C1CONL_DNCNT4_SIZE                       equ 0001h
C1CONL_DNCNT4_LENGTH                     equ 0001h
C1CONL_DNCNT4_MASK                       equ 0010h

// Register: C1CONH
#define C1CONH C1CONH
C1CONH                                   equ 0101h
// bitfield definitions
C1CONH_WAKFIL_POSN                       equ 0000h
C1CONH_WAKFIL_POSITION                   equ 0000h
C1CONH_WAKFIL_SIZE                       equ 0001h
C1CONH_WAKFIL_LENGTH                     equ 0001h
C1CONH_WAKFIL_MASK                       equ 0001h
C1CONH_WFT_POSN                          equ 0001h
C1CONH_WFT_POSITION                      equ 0001h
C1CONH_WFT_SIZE                          equ 0002h
C1CONH_WFT_LENGTH                        equ 0002h
C1CONH_WFT_MASK                          equ 0006h
C1CONH_BUSY_POSN                         equ 0003h
C1CONH_BUSY_POSITION                     equ 0003h
C1CONH_BUSY_SIZE                         equ 0001h
C1CONH_BUSY_LENGTH                       equ 0001h
C1CONH_BUSY_MASK                         equ 0008h
C1CONH_BRSDIS_POSN                       equ 0004h
C1CONH_BRSDIS_POSITION                   equ 0004h
C1CONH_BRSDIS_SIZE                       equ 0001h
C1CONH_BRSDIS_LENGTH                     equ 0001h
C1CONH_BRSDIS_MASK                       equ 0010h
C1CONH_SIDL_POSN                         equ 0005h
C1CONH_SIDL_POSITION                     equ 0005h
C1CONH_SIDL_SIZE                         equ 0001h
C1CONH_SIDL_LENGTH                       equ 0001h
C1CONH_SIDL_MASK                         equ 0020h
C1CONH_FRZ_POSN                          equ 0006h
C1CONH_FRZ_POSITION                      equ 0006h
C1CONH_FRZ_SIZE                          equ 0001h
C1CONH_FRZ_LENGTH                        equ 0001h
C1CONH_FRZ_MASK                          equ 0040h
C1CONH_ON_POSN                           equ 0007h
C1CONH_ON_POSITION                       equ 0007h
C1CONH_ON_SIZE                           equ 0001h
C1CONH_ON_LENGTH                         equ 0001h
C1CONH_ON_MASK                           equ 0080h
C1CONH_WFT0_POSN                         equ 0001h
C1CONH_WFT0_POSITION                     equ 0001h
C1CONH_WFT0_SIZE                         equ 0001h
C1CONH_WFT0_LENGTH                       equ 0001h
C1CONH_WFT0_MASK                         equ 0002h
C1CONH_WFT1_POSN                         equ 0002h
C1CONH_WFT1_POSITION                     equ 0002h
C1CONH_WFT1_SIZE                         equ 0001h
C1CONH_WFT1_LENGTH                       equ 0001h
C1CONH_WFT1_MASK                         equ 0004h

// Register: C1CONU
#define C1CONU C1CONU
C1CONU                                   equ 0102h
// bitfield definitions
C1CONU_RTXAT_POSN                        equ 0000h
C1CONU_RTXAT_POSITION                    equ 0000h
C1CONU_RTXAT_SIZE                        equ 0001h
C1CONU_RTXAT_LENGTH                      equ 0001h
C1CONU_RTXAT_MASK                        equ 0001h
C1CONU_ESIGM_POSN                        equ 0001h
C1CONU_ESIGM_POSITION                    equ 0001h
C1CONU_ESIGM_SIZE                        equ 0001h
C1CONU_ESIGM_LENGTH                      equ 0001h
C1CONU_ESIGM_MASK                        equ 0002h
C1CONU_SERR2LOM_POSN                     equ 0002h
C1CONU_SERR2LOM_POSITION                 equ 0002h
C1CONU_SERR2LOM_SIZE                     equ 0001h
C1CONU_SERR2LOM_LENGTH                   equ 0001h
C1CONU_SERR2LOM_MASK                     equ 0004h
C1CONU_STEF_POSN                         equ 0003h
C1CONU_STEF_POSITION                     equ 0003h
C1CONU_STEF_SIZE                         equ 0001h
C1CONU_STEF_LENGTH                       equ 0001h
C1CONU_STEF_MASK                         equ 0008h
C1CONU_TXQEN_POSN                        equ 0004h
C1CONU_TXQEN_POSITION                    equ 0004h
C1CONU_TXQEN_SIZE                        equ 0001h
C1CONU_TXQEN_LENGTH                      equ 0001h
C1CONU_TXQEN_MASK                        equ 0010h
C1CONU_OPMOD_POSN                        equ 0005h
C1CONU_OPMOD_POSITION                    equ 0005h
C1CONU_OPMOD_SIZE                        equ 0003h
C1CONU_OPMOD_LENGTH                      equ 0003h
C1CONU_OPMOD_MASK                        equ 00E0h
C1CONU_OPMOD0_POSN                       equ 0005h
C1CONU_OPMOD0_POSITION                   equ 0005h
C1CONU_OPMOD0_SIZE                       equ 0001h
C1CONU_OPMOD0_LENGTH                     equ 0001h
C1CONU_OPMOD0_MASK                       equ 0020h
C1CONU_OPMOD1_POSN                       equ 0006h
C1CONU_OPMOD1_POSITION                   equ 0006h
C1CONU_OPMOD1_SIZE                       equ 0001h
C1CONU_OPMOD1_LENGTH                     equ 0001h
C1CONU_OPMOD1_MASK                       equ 0040h
C1CONU_OPMOD2_POSN                       equ 0007h
C1CONU_OPMOD2_POSITION                   equ 0007h
C1CONU_OPMOD2_SIZE                       equ 0001h
C1CONU_OPMOD2_LENGTH                     equ 0001h
C1CONU_OPMOD2_MASK                       equ 0080h

