GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: C1TRECT
#define C1TRECT C1TRECT
C1TRECT                                  equ 0137h

// Register: C1BDIAG0L
#define C1BDIAG0L C1BDIAG0L
C1BDIAG0L                                equ 0138h
// bitfield definitions
C1BDIAG0L_NRERRCNT_POSN                  equ 0000h
C1BDIAG0L_NRERRCNT_POSITION              equ 0000h
C1BDIAG0L_NRERRCNT_SIZE                  equ 0008h
C1BDIAG0L_NRERRCNT_LENGTH                equ 0008h
C1BDIAG0L_NRERRCNT_MASK                  equ 00FFh
C1BDIAG0L_NRERRCNT0_POSN                 equ 0000h
C1BDIAG0L_NRERRCNT0_POSITION             equ 0000h
C1BDIAG0L_NRERRCNT0_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT0_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT0_MASK                 equ 0001h
C1BDIAG0L_NRERRCNT1_POSN                 equ 0001h
C1BDIAG0L_NRERRCNT1_POSITION             equ 0001h
C1BDIAG0L_NRERRCNT1_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT1_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT1_MASK                 equ 0002h
C1BDIAG0L_NRERRCNT2_POSN                 equ 0002h
C1BDIAG0L_NRERRCNT2_POSITION             equ 0002h
C1BDIAG0L_NRERRCNT2_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT2_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT2_MASK                 equ 0004h
C1BDIAG0L_NRERRCNT3_POSN                 equ 0003h
C1BDIAG0L_NRERRCNT3_POSITION             equ 0003h
C1BDIAG0L_NRERRCNT3_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT3_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT3_MASK                 equ 0008h
C1BDIAG0L_NRERRCNT4_POSN                 equ 0004h
C1BDIAG0L_NRERRCNT4_POSITION             equ 0004h
C1BDIAG0L_NRERRCNT4_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT4_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT4_MASK                 equ 0010h
C1BDIAG0L_NRERRCNT5_POSN                 equ 0005h
C1BDIAG0L_NRERRCNT5_POSITION             equ 0005h
C1BDIAG0L_NRERRCNT5_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT5_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT5_MASK                 equ 0020h
C1BDIAG0L_NRERRCNT6_POSN                 equ 0006h
C1BDIAG0L_NRERRCNT6_POSITION             equ 0006h
C1BDIAG0L_NRERRCNT6_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT6_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT6_MASK                 equ 0040h
C1BDIAG0L_NRERRCNT7_POSN                 equ 0007h
C1BDIAG0L_NRERRCNT7_POSITION             equ 0007h
C1BDIAG0L_NRERRCNT7_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT7_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT7_MASK                 equ 0080h

// Register: C1BDIAG0H
#define C1BDIAG0H C1BDIAG0H
C1BDIAG0H                                equ 0139h
// bitfield definitions
C1BDIAG0H_NTERRCNT_POSN                  equ 0000h
C1BDIAG0H_NTERRCNT_POSITION              equ 0000h
C1BDIAG0H_NTERRCNT_SIZE                  equ 0008h
C1BDIAG0H_NTERRCNT_LENGTH                equ 0008h
C1BDIAG0H_NTERRCNT_MASK                  equ 00FFh
C1BDIAG0H_NTERRCNT0_POSN                 equ 0000h
C1BDIAG0H_NTERRCNT0_POSITION             equ 0000h
C1BDIAG0H_NTERRCNT0_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT0_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT0_MASK                 equ 0001h
C1BDIAG0H_NTERRCNT1_POSN                 equ 0001h
C1BDIAG0H_NTERRCNT1_POSITION             equ 0001h
C1BDIAG0H_NTERRCNT1_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT1_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT1_MASK                 equ 0002h
C1BDIAG0H_NTERRCNT2_POSN                 equ 0002h
C1BDIAG0H_NTERRCNT2_POSITION             equ 0002h
C1BDIAG0H_NTERRCNT2_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT2_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT2_MASK                 equ 0004h
C1BDIAG0H_NTERRCNT3_POSN                 equ 0003h
C1BDIAG0H_NTERRCNT3_POSITION             equ 0003h
C1BDIAG0H_NTERRCNT3_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT3_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT3_MASK                 equ 0008h
C1BDIAG0H_NTERRCNT4_POSN                 equ 0004h
C1BDIAG0H_NTERRCNT4_POSITION             equ 0004h
C1BDIAG0H_NTERRCNT4_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT4_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT4_MASK                 equ 0010h
C1BDIAG0H_NTERRCNT5_POSN                 equ 0005h
C1BDIAG0H_NTERRCNT5_POSITION             equ 0005h
C1BDIAG0H_NTERRCNT5_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT5_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT5_MASK                 equ 0020h
C1BDIAG0H_NTERRCNT6_POSN                 equ 0006h
C1BDIAG0H_NTERRCNT6_POSITION             equ 0006h
C1BDIAG0H_NTERRCNT6_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT6_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT6_MASK                 equ 0040h
C1BDIAG0H_NTERRCNT7_POSN                 equ 0007h
C1BDIAG0H_NTERRCNT7_POSITION             equ 0007h
C1BDIAG0H_NTERRCNT7_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT7_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT7_MASK                 equ 0080h

// Register: C1BDIAG0U
#define C1BDIAG0U C1BDIAG0U
C1BDIAG0U                                equ 013Ah
// bitfield definitions
C1BDIAG0U_DRERRCNT_POSN                  equ 0000h
C1BDIAG0U_DRERRCNT_POSITION              equ 0000h
C1BDIAG0U_DRERRCNT_SIZE                  equ 0008h
C1BDIAG0U_DRERRCNT_LENGTH                equ 0008h
C1BDIAG0U_DRERRCNT_MASK                  equ 00FFh
C1BDIAG0U_DRERRCNT0_POSN                 equ 0000h
C1BDIAG0U_DRERRCNT0_POSITION             equ 0000h
C1BDIAG0U_DRERRCNT0_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT0_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT0_MASK                 equ 0001h
C1BDIAG0U_DRERRCNT1_POSN                 equ 0001h
C1BDIAG0U_DRERRCNT1_POSITION             equ 0001h
C1BDIAG0U_DRERRCNT1_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT1_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT1_MASK                 equ 0002h
C1BDIAG0U_DRERRCNT2_POSN                 equ 0002h
C1BDIAG0U_DRERRCNT2_POSITION             equ 0002h
C1BDIAG0U_DRERRCNT2_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT2_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT2_MASK                 equ 0004h
C1BDIAG0U_DRERRCNT3_POSN                 equ 0003h
C1BDIAG0U_DRERRCNT3_POSITION             equ 0003h
C1BDIAG0U_DRERRCNT3_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT3_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT3_MASK                 equ 0008h
C1BDIAG0U_DRERRCNT4_POSN                 equ 0004h
C1BDIAG0U_DRERRCNT4_POSITION             equ 0004h
C1BDIAG0U_DRERRCNT4_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT4_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT4_MASK                 equ 0010h
C1BDIAG0U_DRERRCNT5_POSN                 equ 0005h
C1BDIAG0U_DRERRCNT5_POSITION             equ 0005h
C1BDIAG0U_DRERRCNT5_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT5_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT5_MASK                 equ 0020h
C1BDIAG0U_DRERRCNT6_POSN                 equ 0006h
C1BDIAG0U_DRERRCNT6_POSITION             equ 0006h
C1BDIAG0U_DRERRCNT6_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT6_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT6_MASK                 equ 0040h
C1BDIAG0U_DRERRCNT7_POSN                 equ 0007h
C1BDIAG0U_DRERRCNT7_POSITION             equ 0007h
C1BDIAG0U_DRERRCNT7_SIZE                 equ 0001h
C1BDIAG0U_DRERRCNT7_LENGTH               equ 0001h
C1BDIAG0U_DRERRCNT7_MASK                 equ 0080h

// Register: C1BDIAG0T
#define C1BDIAG0T C1BDIAG0T
C1BDIAG0T                                equ 013Bh
// bitfield definitions
C1BDIAG0T_DTERRCNT_POSN                  equ 0000h
C1BDIAG0T_DTERRCNT_POSITION              equ 0000h
C1BDIAG0T_DTERRCNT_SIZE                  equ 0008h
C1BDIAG0T_DTERRCNT_LENGTH                equ 0008h
C1BDIAG0T_DTERRCNT_MASK                  equ 00FFh
C1BDIAG0T_DTERRCNT0_POSN                 equ 0000h
C1BDIAG0T_DTERRCNT0_POSITION             equ 0000h
C1BDIAG0T_DTERRCNT0_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT0_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT0_MASK                 equ 0001h
C1BDIAG0T_DTERRCNT1_POSN                 equ 0001h
C1BDIAG0T_DTERRCNT1_POSITION             equ 0001h
C1BDIAG0T_DTERRCNT1_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT1_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT1_MASK                 equ 0002h
C1BDIAG0T_DTERRCNT2_POSN                 equ 0002h
C1BDIAG0T_DTERRCNT2_POSITION             equ 0002h
C1BDIAG0T_DTERRCNT2_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT2_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT2_MASK                 equ 0004h
C1BDIAG0T_DTERRCNT3_POSN                 equ 0003h
C1BDIAG0T_DTERRCNT3_POSITION             equ 0003h
C1BDIAG0T_DTERRCNT3_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT3_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT3_MASK                 equ 0008h
C1BDIAG0T_DTERRCNT4_POSN                 equ 0004h
C1BDIAG0T_DTERRCNT4_POSITION             equ 0004h
C1BDIAG0T_DTERRCNT4_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT4_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT4_MASK                 equ 0010h
C1BDIAG0T_DTERRCNT5_POSN                 equ 0005h
C1BDIAG0T_DTERRCNT5_POSITION             equ 0005h
C1BDIAG0T_DTERRCNT5_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT5_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT5_MASK                 equ 0020h
C1BDIAG0T_DTERRCNT6_POSN                 equ 0006h
C1BDIAG0T_DTERRCNT6_POSITION             equ 0006h
C1BDIAG0T_DTERRCNT6_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT6_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT6_MASK                 equ 0040h
C1BDIAG0T_DTERRCNT7_POSN                 equ 0007h
C1BDIAG0T_DTERRCNT7_POSITION             equ 0007h
C1BDIAG0T_DTERRCNT7_SIZE                 equ 0001h
C1BDIAG0T_DTERRCNT7_LENGTH               equ 0001h
C1BDIAG0T_DTERRCNT7_MASK                 equ 0080h

