GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: C1FLTOBJ2T
#define C1FLTOBJ2T C1FLTOBJ2T
C1FLTOBJ2T                               equ 019Fh
// bitfield definitions
C1FLTOBJ2T_EID_POSN                      equ 0000h
C1FLTOBJ2T_EID_POSITION                  equ 0000h
C1FLTOBJ2T_EID_SIZE                      equ 0005h
C1FLTOBJ2T_EID_LENGTH                    equ 0005h
C1FLTOBJ2T_EID_MASK                      equ 001Fh
C1FLTOBJ2T_SID11_POSN                    equ 0005h
C1FLTOBJ2T_SID11_POSITION                equ 0005h
C1FLTOBJ2T_SID11_SIZE                    equ 0001h
C1FLTOBJ2T_SID11_LENGTH                  equ 0001h
C1FLTOBJ2T_SID11_MASK                    equ 0020h
C1FLTOBJ2T_EXIDE_POSN                    equ 0006h
C1FLTOBJ2T_EXIDE_POSITION                equ 0006h
C1FLTOBJ2T_EXIDE_SIZE                    equ 0001h
C1FLTOBJ2T_EXIDE_LENGTH                  equ 0001h
C1FLTOBJ2T_EXIDE_MASK                    equ 0040h
C1FLTOBJ2T_EID13_POSN                    equ 0000h
C1FLTOBJ2T_EID13_POSITION                equ 0000h
C1FLTOBJ2T_EID13_SIZE                    equ 0001h
C1FLTOBJ2T_EID13_LENGTH                  equ 0001h
C1FLTOBJ2T_EID13_MASK                    equ 0001h
C1FLTOBJ2T_EID14_POSN                    equ 0001h
C1FLTOBJ2T_EID14_POSITION                equ 0001h
C1FLTOBJ2T_EID14_SIZE                    equ 0001h
C1FLTOBJ2T_EID14_LENGTH                  equ 0001h
C1FLTOBJ2T_EID14_MASK                    equ 0002h
C1FLTOBJ2T_EID15_POSN                    equ 0002h
C1FLTOBJ2T_EID15_POSITION                equ 0002h
C1FLTOBJ2T_EID15_SIZE                    equ 0001h
C1FLTOBJ2T_EID15_LENGTH                  equ 0001h
C1FLTOBJ2T_EID15_MASK                    equ 0004h
C1FLTOBJ2T_EID16_POSN                    equ 0003h
C1FLTOBJ2T_EID16_POSITION                equ 0003h
C1FLTOBJ2T_EID16_SIZE                    equ 0001h
C1FLTOBJ2T_EID16_LENGTH                  equ 0001h
C1FLTOBJ2T_EID16_MASK                    equ 0008h
C1FLTOBJ2T_EID17_POSN                    equ 0004h
C1FLTOBJ2T_EID17_POSITION                equ 0004h
C1FLTOBJ2T_EID17_SIZE                    equ 0001h
C1FLTOBJ2T_EID17_LENGTH                  equ 0001h
C1FLTOBJ2T_EID17_MASK                    equ 0010h

// Register: C1MASK2
#define C1MASK2 C1MASK2
C1MASK2                                  equ 01A0h

// Register: C1MASK2L
#define C1MASK2L C1MASK2L
C1MASK2L                                 equ 01A0h
// bitfield definitions
C1MASK2L_MSID_POSN                       equ 0000h
C1MASK2L_MSID_POSITION                   equ 0000h
C1MASK2L_MSID_SIZE                       equ 0008h
C1MASK2L_MSID_LENGTH                     equ 0008h
C1MASK2L_MSID_MASK                       equ 00FFh
C1MASK2L_MSID0_POSN                      equ 0000h
C1MASK2L_MSID0_POSITION                  equ 0000h
C1MASK2L_MSID0_SIZE                      equ 0001h
C1MASK2L_MSID0_LENGTH                    equ 0001h
C1MASK2L_MSID0_MASK                      equ 0001h
C1MASK2L_MSID1_POSN                      equ 0001h
C1MASK2L_MSID1_POSITION                  equ 0001h
C1MASK2L_MSID1_SIZE                      equ 0001h
C1MASK2L_MSID1_LENGTH                    equ 0001h
C1MASK2L_MSID1_MASK                      equ 0002h
C1MASK2L_MSID2_POSN                      equ 0002h
C1MASK2L_MSID2_POSITION                  equ 0002h
C1MASK2L_MSID2_SIZE                      equ 0001h
C1MASK2L_MSID2_LENGTH                    equ 0001h
C1MASK2L_MSID2_MASK                      equ 0004h
C1MASK2L_MSID3_POSN                      equ 0003h
C1MASK2L_MSID3_POSITION                  equ 0003h
C1MASK2L_MSID3_SIZE                      equ 0001h
C1MASK2L_MSID3_LENGTH                    equ 0001h
C1MASK2L_MSID3_MASK                      equ 0008h
C1MASK2L_MSID4_POSN                      equ 0004h
C1MASK2L_MSID4_POSITION                  equ 0004h
C1MASK2L_MSID4_SIZE                      equ 0001h
C1MASK2L_MSID4_LENGTH                    equ 0001h
C1MASK2L_MSID4_MASK                      equ 0010h
C1MASK2L_MSID5_POSN                      equ 0005h
C1MASK2L_MSID5_POSITION                  equ 0005h
C1MASK2L_MSID5_SIZE                      equ 0001h
C1MASK2L_MSID5_LENGTH                    equ 0001h
C1MASK2L_MSID5_MASK                      equ 0020h
C1MASK2L_MSID6_POSN                      equ 0006h
C1MASK2L_MSID6_POSITION                  equ 0006h
C1MASK2L_MSID6_SIZE                      equ 0001h
C1MASK2L_MSID6_LENGTH                    equ 0001h
C1MASK2L_MSID6_MASK                      equ 0040h
C1MASK2L_MSID7_POSN                      equ 0007h
C1MASK2L_MSID7_POSITION                  equ 0007h
C1MASK2L_MSID7_SIZE                      equ 0001h
C1MASK2L_MSID7_LENGTH                    equ 0001h
C1MASK2L_MSID7_MASK                      equ 0080h

// Register: C1MASK2H
#define C1MASK2H C1MASK2H
C1MASK2H                                 equ 01A1h
// bitfield definitions
C1MASK2H_MSID_POSN                       equ 0000h
C1MASK2H_MSID_POSITION                   equ 0000h
C1MASK2H_MSID_SIZE                       equ 0003h
C1MASK2H_MSID_LENGTH                     equ 0003h
C1MASK2H_MSID_MASK                       equ 0007h
C1MASK2H_MEID_POSN                       equ 0003h
C1MASK2H_MEID_POSITION                   equ 0003h
C1MASK2H_MEID_SIZE                       equ 0005h
C1MASK2H_MEID_LENGTH                     equ 0005h
C1MASK2H_MEID_MASK                       equ 00F8h
C1MASK2H_MSID8_POSN                      equ 0000h
C1MASK2H_MSID8_POSITION                  equ 0000h
C1MASK2H_MSID8_SIZE                      equ 0001h
C1MASK2H_MSID8_LENGTH                    equ 0001h
C1MASK2H_MSID8_MASK                      equ 0001h
C1MASK2H_MSID9_POSN                      equ 0001h
C1MASK2H_MSID9_POSITION                  equ 0001h
C1MASK2H_MSID9_SIZE                      equ 0001h
C1MASK2H_MSID9_LENGTH                    equ 0001h
C1MASK2H_MSID9_MASK                      equ 0002h
C1MASK2H_MSID10_POSN                     equ 0002h
C1MASK2H_MSID10_POSITION                 equ 0002h
C1MASK2H_MSID10_SIZE                     equ 0001h
C1MASK2H_MSID10_LENGTH                   equ 0001h
C1MASK2H_MSID10_MASK                     equ 0004h
C1MASK2H_MEID0_POSN                      equ 0003h
C1MASK2H_MEID0_POSITION                  equ 0003h
C1MASK2H_MEID0_SIZE                      equ 0001h
C1MASK2H_MEID0_LENGTH                    equ 0001h
C1MASK2H_MEID0_MASK                      equ 0008h
C1MASK2H_MEID1_POSN                      equ 0004h
C1MASK2H_MEID1_POSITION                  equ 0004h
C1MASK2H_MEID1_SIZE                      equ 0001h
C1MASK2H_MEID1_LENGTH                    equ 0001h
C1MASK2H_MEID1_MASK                      equ 0010h
C1MASK2H_MEID2_POSN                      equ 0005h
C1MASK2H_MEID2_POSITION                  equ 0005h
C1MASK2H_MEID2_SIZE                      equ 0001h
C1MASK2H_MEID2_LENGTH                    equ 0001h
C1MASK2H_MEID2_MASK                      equ 0020h
C1MASK2H_MEID3_POSN                      equ 0006h
C1MASK2H_MEID3_POSITION                  equ 0006h
C1MASK2H_MEID3_SIZE                      equ 0001h
C1MASK2H_MEID3_LENGTH                    equ 0001h
C1MASK2H_MEID3_MASK                      equ 0040h
C1MASK2H_MEID4_POSN                      equ 0007h
C1MASK2H_MEID4_POSITION                  equ 0007h
C1MASK2H_MEID4_SIZE                      equ 0001h
C1MASK2H_MEID4_LENGTH                    equ 0001h
C1MASK2H_MEID4_MASK                      equ 0080h

