GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: C1MASK4T
#define C1MASK4T C1MASK4T
C1MASK4T                                 equ 01B3h
// bitfield definitions
C1MASK4T_MEID_POSN                       equ 0000h
C1MASK4T_MEID_POSITION                   equ 0000h
C1MASK4T_MEID_SIZE                       equ 0005h
C1MASK4T_MEID_LENGTH                     equ 0005h
C1MASK4T_MEID_MASK                       equ 001Fh
C1MASK4T_MSID11_POSN                     equ 0005h
C1MASK4T_MSID11_POSITION                 equ 0005h
C1MASK4T_MSID11_SIZE                     equ 0001h
C1MASK4T_MSID11_LENGTH                   equ 0001h
C1MASK4T_MSID11_MASK                     equ 0020h
C1MASK4T_MIDE_POSN                       equ 0006h
C1MASK4T_MIDE_POSITION                   equ 0006h
C1MASK4T_MIDE_SIZE                       equ 0001h
C1MASK4T_MIDE_LENGTH                     equ 0001h
C1MASK4T_MIDE_MASK                       equ 0040h
C1MASK4T_MEID13_POSN                     equ 0000h
C1MASK4T_MEID13_POSITION                 equ 0000h
C1MASK4T_MEID13_SIZE                     equ 0001h
C1MASK4T_MEID13_LENGTH                   equ 0001h
C1MASK4T_MEID13_MASK                     equ 0001h
C1MASK4T_MEID14_POSN                     equ 0001h
C1MASK4T_MEID14_POSITION                 equ 0001h
C1MASK4T_MEID14_SIZE                     equ 0001h
C1MASK4T_MEID14_LENGTH                   equ 0001h
C1MASK4T_MEID14_MASK                     equ 0002h
C1MASK4T_MEID15_POSN                     equ 0002h
C1MASK4T_MEID15_POSITION                 equ 0002h
C1MASK4T_MEID15_SIZE                     equ 0001h
C1MASK4T_MEID15_LENGTH                   equ 0001h
C1MASK4T_MEID15_MASK                     equ 0004h
C1MASK4T_MEID16_POSN                     equ 0003h
C1MASK4T_MEID16_POSITION                 equ 0003h
C1MASK4T_MEID16_SIZE                     equ 0001h
C1MASK4T_MEID16_LENGTH                   equ 0001h
C1MASK4T_MEID16_MASK                     equ 0008h
C1MASK4T_MEID17_POSN                     equ 0004h
C1MASK4T_MEID17_POSITION                 equ 0004h
C1MASK4T_MEID17_SIZE                     equ 0001h
C1MASK4T_MEID17_LENGTH                   equ 0001h
C1MASK4T_MEID17_MASK                     equ 0010h

// Register: C1FLTOBJ5
#define C1FLTOBJ5 C1FLTOBJ5
C1FLTOBJ5                                equ 01B4h

// Register: C1FLTOBJ5L
#define C1FLTOBJ5L C1FLTOBJ5L
C1FLTOBJ5L                               equ 01B4h
// bitfield definitions
C1FLTOBJ5L_SID_POSN                      equ 0000h
C1FLTOBJ5L_SID_POSITION                  equ 0000h
C1FLTOBJ5L_SID_SIZE                      equ 0008h
C1FLTOBJ5L_SID_LENGTH                    equ 0008h
C1FLTOBJ5L_SID_MASK                      equ 00FFh
C1FLTOBJ5L_SID0_POSN                     equ 0000h
C1FLTOBJ5L_SID0_POSITION                 equ 0000h
C1FLTOBJ5L_SID0_SIZE                     equ 0001h
C1FLTOBJ5L_SID0_LENGTH                   equ 0001h
C1FLTOBJ5L_SID0_MASK                     equ 0001h
C1FLTOBJ5L_SID1_POSN                     equ 0001h
C1FLTOBJ5L_SID1_POSITION                 equ 0001h
C1FLTOBJ5L_SID1_SIZE                     equ 0001h
C1FLTOBJ5L_SID1_LENGTH                   equ 0001h
C1FLTOBJ5L_SID1_MASK                     equ 0002h
C1FLTOBJ5L_SID2_POSN                     equ 0002h
C1FLTOBJ5L_SID2_POSITION                 equ 0002h
C1FLTOBJ5L_SID2_SIZE                     equ 0001h
C1FLTOBJ5L_SID2_LENGTH                   equ 0001h
C1FLTOBJ5L_SID2_MASK                     equ 0004h
C1FLTOBJ5L_SID3_POSN                     equ 0003h
C1FLTOBJ5L_SID3_POSITION                 equ 0003h
C1FLTOBJ5L_SID3_SIZE                     equ 0001h
C1FLTOBJ5L_SID3_LENGTH                   equ 0001h
C1FLTOBJ5L_SID3_MASK                     equ 0008h
C1FLTOBJ5L_SID4_POSN                     equ 0004h
C1FLTOBJ5L_SID4_POSITION                 equ 0004h
C1FLTOBJ5L_SID4_SIZE                     equ 0001h
C1FLTOBJ5L_SID4_LENGTH                   equ 0001h
C1FLTOBJ5L_SID4_MASK                     equ 0010h
C1FLTOBJ5L_SID5_POSN                     equ 0005h
C1FLTOBJ5L_SID5_POSITION                 equ 0005h
C1FLTOBJ5L_SID5_SIZE                     equ 0001h
C1FLTOBJ5L_SID5_LENGTH                   equ 0001h
C1FLTOBJ5L_SID5_MASK                     equ 0020h
C1FLTOBJ5L_SID6_POSN                     equ 0006h
C1FLTOBJ5L_SID6_POSITION                 equ 0006h
C1FLTOBJ5L_SID6_SIZE                     equ 0001h
C1FLTOBJ5L_SID6_LENGTH                   equ 0001h
C1FLTOBJ5L_SID6_MASK                     equ 0040h
C1FLTOBJ5L_SID7_POSN                     equ 0007h
C1FLTOBJ5L_SID7_POSITION                 equ 0007h
C1FLTOBJ5L_SID7_SIZE                     equ 0001h
C1FLTOBJ5L_SID7_LENGTH                   equ 0001h
C1FLTOBJ5L_SID7_MASK                     equ 0080h

// Register: C1FLTOBJ5H
#define C1FLTOBJ5H C1FLTOBJ5H
C1FLTOBJ5H                               equ 01B5h
// bitfield definitions
C1FLTOBJ5H_SID_POSN                      equ 0000h
C1FLTOBJ5H_SID_POSITION                  equ 0000h
C1FLTOBJ5H_SID_SIZE                      equ 0003h
C1FLTOBJ5H_SID_LENGTH                    equ 0003h
C1FLTOBJ5H_SID_MASK                      equ 0007h
C1FLTOBJ5H_EID_POSN                      equ 0003h
C1FLTOBJ5H_EID_POSITION                  equ 0003h
C1FLTOBJ5H_EID_SIZE                      equ 0005h
C1FLTOBJ5H_EID_LENGTH                    equ 0005h
C1FLTOBJ5H_EID_MASK                      equ 00F8h
C1FLTOBJ5H_SID8_POSN                     equ 0000h
C1FLTOBJ5H_SID8_POSITION                 equ 0000h
C1FLTOBJ5H_SID8_SIZE                     equ 0001h
C1FLTOBJ5H_SID8_LENGTH                   equ 0001h
C1FLTOBJ5H_SID8_MASK                     equ 0001h
C1FLTOBJ5H_SID9_POSN                     equ 0001h
C1FLTOBJ5H_SID9_POSITION                 equ 0001h
C1FLTOBJ5H_SID9_SIZE                     equ 0001h
C1FLTOBJ5H_SID9_LENGTH                   equ 0001h
C1FLTOBJ5H_SID9_MASK                     equ 0002h
C1FLTOBJ5H_SID10_POSN                    equ 0002h
C1FLTOBJ5H_SID10_POSITION                equ 0002h
C1FLTOBJ5H_SID10_SIZE                    equ 0001h
C1FLTOBJ5H_SID10_LENGTH                  equ 0001h
C1FLTOBJ5H_SID10_MASK                    equ 0004h
C1FLTOBJ5H_EID0_POSN                     equ 0003h
C1FLTOBJ5H_EID0_POSITION                 equ 0003h
C1FLTOBJ5H_EID0_SIZE                     equ 0001h
C1FLTOBJ5H_EID0_LENGTH                   equ 0001h
C1FLTOBJ5H_EID0_MASK                     equ 0008h
C1FLTOBJ5H_EID1_POSN                     equ 0004h
C1FLTOBJ5H_EID1_POSITION                 equ 0004h
C1FLTOBJ5H_EID1_SIZE                     equ 0001h
C1FLTOBJ5H_EID1_LENGTH                   equ 0001h
C1FLTOBJ5H_EID1_MASK                     equ 0010h
C1FLTOBJ5H_EID2_POSN                     equ 0005h
C1FLTOBJ5H_EID2_POSITION                 equ 0005h
C1FLTOBJ5H_EID2_SIZE                     equ 0001h
C1FLTOBJ5H_EID2_LENGTH                   equ 0001h
C1FLTOBJ5H_EID2_MASK                     equ 0020h
C1FLTOBJ5H_EID3_POSN                     equ 0006h
C1FLTOBJ5H_EID3_POSITION                 equ 0006h
C1FLTOBJ5H_EID3_SIZE                     equ 0001h
C1FLTOBJ5H_EID3_LENGTH                   equ 0001h
C1FLTOBJ5H_EID3_MASK                     equ 0040h
C1FLTOBJ5H_EID4_POSN                     equ 0007h
C1FLTOBJ5H_EID4_POSITION                 equ 0007h
C1FLTOBJ5H_EID4_SIZE                     equ 0001h
C1FLTOBJ5H_EID4_LENGTH                   equ 0001h
C1FLTOBJ5H_EID4_MASK                     equ 0080h

// Register: C1FLTOBJ5U
#define C1FLTOBJ5U C1FLTOBJ5U
C1FLTOBJ5U                               equ 01B6h
// bitfield definitions
C1FLTOBJ5U_EID_POSN                      equ 0000h
C1FLTOBJ5U_EID_POSITION                  equ 0000h
C1FLTOBJ5U_EID_SIZE                      equ 0008h
C1FLTOBJ5U_EID_LENGTH                    equ 0008h
C1FLTOBJ5U_EID_MASK                      equ 00FFh
C1FLTOBJ5U_EID5_POSN                     equ 0000h
C1FLTOBJ5U_EID5_POSITION                 equ 0000h
C1FLTOBJ5U_EID5_SIZE                     equ 0001h
C1FLTOBJ5U_EID5_LENGTH                   equ 0001h
C1FLTOBJ5U_EID5_MASK                     equ 0001h
C1FLTOBJ5U_EID6_POSN                     equ 0001h
C1FLTOBJ5U_EID6_POSITION                 equ 0001h
C1FLTOBJ5U_EID6_SIZE                     equ 0001h
C1FLTOBJ5U_EID6_LENGTH                   equ 0001h
C1FLTOBJ5U_EID6_MASK                     equ 0002h
C1FLTOBJ5U_EID7_POSN                     equ 0002h
C1FLTOBJ5U_EID7_POSITION                 equ 0002h
C1FLTOBJ5U_EID7_SIZE                     equ 0001h
C1FLTOBJ5U_EID7_LENGTH                   equ 0001h
C1FLTOBJ5U_EID7_MASK                     equ 0004h
C1FLTOBJ5U_EID8_POSN                     equ 0003h
C1FLTOBJ5U_EID8_POSITION                 equ 0003h
C1FLTOBJ5U_EID8_SIZE                     equ 0001h
C1FLTOBJ5U_EID8_LENGTH                   equ 0001h
C1FLTOBJ5U_EID8_MASK                     equ 0008h
C1FLTOBJ5U_EID9_POSN                     equ 0004h
C1FLTOBJ5U_EID9_POSITION                 equ 0004h
C1FLTOBJ5U_EID9_SIZE                     equ 0001h
C1FLTOBJ5U_EID9_LENGTH                   equ 0001h
C1FLTOBJ5U_EID9_MASK                     equ 0010h
C1FLTOBJ5U_EID10_POSN                    equ 0005h
C1FLTOBJ5U_EID10_POSITION                equ 0005h
C1FLTOBJ5U_EID10_SIZE                    equ 0001h
C1FLTOBJ5U_EID10_LENGTH                  equ 0001h
C1FLTOBJ5U_EID10_MASK                    equ 0020h
C1FLTOBJ5U_EID11_POSN                    equ 0006h
C1FLTOBJ5U_EID11_POSITION                equ 0006h
C1FLTOBJ5U_EID11_SIZE                    equ 0001h
C1FLTOBJ5U_EID11_LENGTH                  equ 0001h
C1FLTOBJ5U_EID11_MASK                    equ 0040h
C1FLTOBJ5U_EID12_POSN                    equ 0007h
C1FLTOBJ5U_EID12_POSITION                equ 0007h
C1FLTOBJ5U_EID12_SIZE                    equ 0001h
C1FLTOBJ5U_EID12_LENGTH                  equ 0001h
C1FLTOBJ5U_EID12_MASK                    equ 0080h

// Register: C1FLTOBJ5T
#define C1FLTOBJ5T C1FLTOBJ5T
C1FLTOBJ5T                               equ 01B7h
// bitfield definitions
C1FLTOBJ5T_EID_POSN                      equ 0000h
C1FLTOBJ5T_EID_POSITION                  equ 0000h
C1FLTOBJ5T_EID_SIZE                      equ 0005h
C1FLTOBJ5T_EID_LENGTH                    equ 0005h
C1FLTOBJ5T_EID_MASK                      equ 001Fh
C1FLTOBJ5T_SID11_POSN                    equ 0005h
C1FLTOBJ5T_SID11_POSITION                equ 0005h
C1FLTOBJ5T_SID11_SIZE                    equ 0001h
C1FLTOBJ5T_SID11_LENGTH                  equ 0001h
C1FLTOBJ5T_SID11_MASK                    equ 0020h
C1FLTOBJ5T_EXIDE_POSN                    equ 0006h
C1FLTOBJ5T_EXIDE_POSITION                equ 0006h
C1FLTOBJ5T_EXIDE_SIZE                    equ 0001h
C1FLTOBJ5T_EXIDE_LENGTH                  equ 0001h
C1FLTOBJ5T_EXIDE_MASK                    equ 0040h
C1FLTOBJ5T_EID13_POSN                    equ 0000h
C1FLTOBJ5T_EID13_POSITION                equ 0000h
C1FLTOBJ5T_EID13_SIZE                    equ 0001h
C1FLTOBJ5T_EID13_LENGTH                  equ 0001h
C1FLTOBJ5T_EID13_MASK                    equ 0001h
C1FLTOBJ5T_EID14_POSN                    equ 0001h
C1FLTOBJ5T_EID14_POSITION                equ 0001h
C1FLTOBJ5T_EID14_SIZE                    equ 0001h
C1FLTOBJ5T_EID14_LENGTH                  equ 0001h
C1FLTOBJ5T_EID14_MASK                    equ 0002h
C1FLTOBJ5T_EID15_POSN                    equ 0002h
C1FLTOBJ5T_EID15_POSITION                equ 0002h
C1FLTOBJ5T_EID15_SIZE                    equ 0001h
C1FLTOBJ5T_EID15_LENGTH                  equ 0001h
C1FLTOBJ5T_EID15_MASK                    equ 0004h
C1FLTOBJ5T_EID16_POSN                    equ 0003h
C1FLTOBJ5T_EID16_POSITION                equ 0003h
C1FLTOBJ5T_EID16_SIZE                    equ 0001h
C1FLTOBJ5T_EID16_LENGTH                  equ 0001h
C1FLTOBJ5T_EID16_MASK                    equ 0008h
C1FLTOBJ5T_EID17_POSN                    equ 0004h
C1FLTOBJ5T_EID17_POSITION                equ 0004h
C1FLTOBJ5T_EID17_SIZE                    equ 0001h
C1FLTOBJ5T_EID17_LENGTH                  equ 0001h
C1FLTOBJ5T_EID17_MASK                    equ 0010h

// Register: C1MASK5
#define C1MASK5 C1MASK5
C1MASK5                                  equ 01B8h

// Register: C1MASK5L
#define C1MASK5L C1MASK5L
C1MASK5L                                 equ 01B8h
// bitfield definitions
C1MASK5L_MSID_POSN                       equ 0000h
C1MASK5L_MSID_POSITION                   equ 0000h
C1MASK5L_MSID_SIZE                       equ 0008h
C1MASK5L_MSID_LENGTH                     equ 0008h
C1MASK5L_MSID_MASK                       equ 00FFh
C1MASK5L_MSID0_POSN                      equ 0000h
C1MASK5L_MSID0_POSITION                  equ 0000h
C1MASK5L_MSID0_SIZE                      equ 0001h
C1MASK5L_MSID0_LENGTH                    equ 0001h
C1MASK5L_MSID0_MASK                      equ 0001h
C1MASK5L_MSID1_POSN                      equ 0001h
C1MASK5L_MSID1_POSITION                  equ 0001h
C1MASK5L_MSID1_SIZE                      equ 0001h
C1MASK5L_MSID1_LENGTH                    equ 0001h
C1MASK5L_MSID1_MASK                      equ 0002h
C1MASK5L_MSID2_POSN                      equ 0002h
C1MASK5L_MSID2_POSITION                  equ 0002h
C1MASK5L_MSID2_SIZE                      equ 0001h
C1MASK5L_MSID2_LENGTH                    equ 0001h
C1MASK5L_MSID2_MASK                      equ 0004h
C1MASK5L_MSID3_POSN                      equ 0003h
C1MASK5L_MSID3_POSITION                  equ 0003h
C1MASK5L_MSID3_SIZE                      equ 0001h
C1MASK5L_MSID3_LENGTH                    equ 0001h
C1MASK5L_MSID3_MASK                      equ 0008h
C1MASK5L_MSID4_POSN                      equ 0004h
C1MASK5L_MSID4_POSITION                  equ 0004h
C1MASK5L_MSID4_SIZE                      equ 0001h
C1MASK5L_MSID4_LENGTH                    equ 0001h
C1MASK5L_MSID4_MASK                      equ 0010h
C1MASK5L_MSID5_POSN                      equ 0005h
C1MASK5L_MSID5_POSITION                  equ 0005h
C1MASK5L_MSID5_SIZE                      equ 0001h
C1MASK5L_MSID5_LENGTH                    equ 0001h
C1MASK5L_MSID5_MASK                      equ 0020h
C1MASK5L_MSID6_POSN                      equ 0006h
C1MASK5L_MSID6_POSITION                  equ 0006h
C1MASK5L_MSID6_SIZE                      equ 0001h
C1MASK5L_MSID6_LENGTH                    equ 0001h
C1MASK5L_MSID6_MASK                      equ 0040h
C1MASK5L_MSID7_POSN                      equ 0007h
C1MASK5L_MSID7_POSITION                  equ 0007h
C1MASK5L_MSID7_SIZE                      equ 0001h
C1MASK5L_MSID7_LENGTH                    equ 0001h
C1MASK5L_MSID7_MASK                      equ 0080h

// Register: C1MASK5H
#define C1MASK5H C1MASK5H
C1MASK5H                                 equ 01B9h
// bitfield definitions
C1MASK5H_MSID_POSN                       equ 0000h
C1MASK5H_MSID_POSITION                   equ 0000h
C1MASK5H_MSID_SIZE                       equ 0003h
C1MASK5H_MSID_LENGTH                     equ 0003h
C1MASK5H_MSID_MASK                       equ 0007h
C1MASK5H_MEID_POSN                       equ 0003h
C1MASK5H_MEID_POSITION                   equ 0003h
C1MASK5H_MEID_SIZE                       equ 0005h
C1MASK5H_MEID_LENGTH                     equ 0005h
C1MASK5H_MEID_MASK                       equ 00F8h
C1MASK5H_MSID8_POSN                      equ 0000h
C1MASK5H_MSID8_POSITION                  equ 0000h
C1MASK5H_MSID8_SIZE                      equ 0001h
C1MASK5H_MSID8_LENGTH                    equ 0001h
C1MASK5H_MSID8_MASK                      equ 0001h
C1MASK5H_MSID9_POSN                      equ 0001h
C1MASK5H_MSID9_POSITION                  equ 0001h
C1MASK5H_MSID9_SIZE                      equ 0001h
C1MASK5H_MSID9_LENGTH                    equ 0001h
C1MASK5H_MSID9_MASK                      equ 0002h
C1MASK5H_MSID10_POSN                     equ 0002h
C1MASK5H_MSID10_POSITION                 equ 0002h
C1MASK5H_MSID10_SIZE                     equ 0001h
C1MASK5H_MSID10_LENGTH                   equ 0001h
C1MASK5H_MSID10_MASK                     equ 0004h
C1MASK5H_MEID0_POSN                      equ 0003h
C1MASK5H_MEID0_POSITION                  equ 0003h
C1MASK5H_MEID0_SIZE                      equ 0001h
C1MASK5H_MEID0_LENGTH                    equ 0001h
C1MASK5H_MEID0_MASK                      equ 0008h
C1MASK5H_MEID1_POSN                      equ 0004h
C1MASK5H_MEID1_POSITION                  equ 0004h
C1MASK5H_MEID1_SIZE                      equ 0001h
C1MASK5H_MEID1_LENGTH                    equ 0001h
C1MASK5H_MEID1_MASK                      equ 0010h
C1MASK5H_MEID2_POSN                      equ 0005h
C1MASK5H_MEID2_POSITION                  equ 0005h
C1MASK5H_MEID2_SIZE                      equ 0001h
C1MASK5H_MEID2_LENGTH                    equ 0001h
C1MASK5H_MEID2_MASK                      equ 0020h
C1MASK5H_MEID3_POSN                      equ 0006h
C1MASK5H_MEID3_POSITION                  equ 0006h
C1MASK5H_MEID3_SIZE                      equ 0001h
C1MASK5H_MEID3_LENGTH                    equ 0001h
C1MASK5H_MEID3_MASK                      equ 0040h
C1MASK5H_MEID4_POSN                      equ 0007h
C1MASK5H_MEID4_POSITION                  equ 0007h
C1MASK5H_MEID4_SIZE                      equ 0001h
C1MASK5H_MEID4_LENGTH                    equ 0001h
C1MASK5H_MEID4_MASK                      equ 0080h

// Register: C1MASK5U
#define C1MASK5U C1MASK5U
C1MASK5U                                 equ 01BAh
// bitfield definitions
C1MASK5U_MEID_POSN                       equ 0000h
C1MASK5U_MEID_POSITION                   equ 0000h
C1MASK5U_MEID_SIZE                       equ 0008h
C1MASK5U_MEID_LENGTH                     equ 0008h
C1MASK5U_MEID_MASK                       equ 00FFh
C1MASK5U_MEID5_POSN                      equ 0000h
C1MASK5U_MEID5_POSITION                  equ 0000h
C1MASK5U_MEID5_SIZE                      equ 0001h
C1MASK5U_MEID5_LENGTH                    equ 0001h
C1MASK5U_MEID5_MASK                      equ 0001h
C1MASK5U_MEID6_POSN                      equ 0001h
C1MASK5U_MEID6_POSITION                  equ 0001h
C1MASK5U_MEID6_SIZE                      equ 0001h
C1MASK5U_MEID6_LENGTH                    equ 0001h
C1MASK5U_MEID6_MASK                      equ 0002h
C1MASK5U_MEID7_POSN                      equ 0002h
C1MASK5U_MEID7_POSITION                  equ 0002h
C1MASK5U_MEID7_SIZE                      equ 0001h
C1MASK5U_MEID7_LENGTH                    equ 0001h
C1MASK5U_MEID7_MASK                      equ 0004h
C1MASK5U_MEID8_POSN                      equ 0003h
C1MASK5U_MEID8_POSITION                  equ 0003h
C1MASK5U_MEID8_SIZE                      equ 0001h
C1MASK5U_MEID8_LENGTH                    equ 0001h
C1MASK5U_MEID8_MASK                      equ 0008h
C1MASK5U_MEID9_POSN                      equ 0004h
C1MASK5U_MEID9_POSITION                  equ 0004h
C1MASK5U_MEID9_SIZE                      equ 0001h
C1MASK5U_MEID9_LENGTH                    equ 0001h
C1MASK5U_MEID9_MASK                      equ 0010h
C1MASK5U_MEID10_POSN                     equ 0005h
C1MASK5U_MEID10_POSITION                 equ 0005h
C1MASK5U_MEID10_SIZE                     equ 0001h
C1MASK5U_MEID10_LENGTH                   equ 0001h
C1MASK5U_MEID10_MASK                     equ 0020h
C1MASK5U_MEID11_POSN                     equ 0006h
C1MASK5U_MEID11_POSITION                 equ 0006h
C1MASK5U_MEID11_SIZE                     equ 0001h
C1MASK5U_MEID11_LENGTH                   equ 0001h
C1MASK5U_MEID11_MASK                     equ 0040h
C1MASK5U_MEID12_POSN                     equ 0007h
C1MASK5U_MEID12_POSITION                 equ 0007h
C1MASK5U_MEID12_SIZE                     equ 0001h
C1MASK5U_MEID12_LENGTH                   equ 0001h
C1MASK5U_MEID12_MASK                     equ 0080h

// Register: C1MASK5T
#define C1MASK5T C1MASK5T
C1MASK5T                                 equ 01BBh
// bitfield definitions
C1MASK5T_MEID_POSN                       equ 0000h
C1MASK5T_MEID_POSITION                   equ 0000h
C1MASK5T_MEID_SIZE                       equ 0005h
C1MASK5T_MEID_LENGTH                     equ 0005h
C1MASK5T_MEID_MASK                       equ 001Fh
C1MASK5T_MSID11_POSN                     equ 0005h
C1MASK5T_MSID11_POSITION                 equ 0005h
C1MASK5T_MSID11_SIZE                     equ 0001h
C1MASK5T_MSID11_LENGTH                   equ 0001h
C1MASK5T_MSID11_MASK                     equ 0020h
C1MASK5T_MIDE_POSN                       equ 0006h
C1MASK5T_MIDE_POSITION                   equ 0006h
C1MASK5T_MIDE_SIZE                       equ 0001h
C1MASK5T_MIDE_LENGTH                     equ 0001h
C1MASK5T_MIDE_MASK                       equ 0040h
C1MASK5T_MEID13_POSN                     equ 0000h
C1MASK5T_MEID13_POSITION                 equ 0000h
C1MASK5T_MEID13_SIZE                     equ 0001h
C1MASK5T_MEID13_LENGTH                   equ 0001h
C1MASK5T_MEID13_MASK                     equ 0001h
C1MASK5T_MEID14_POSN                     equ 0001h
C1MASK5T_MEID14_POSITION                 equ 0001h
C1MASK5T_MEID14_SIZE                     equ 0001h
C1MASK5T_MEID14_LENGTH                   equ 0001h
C1MASK5T_MEID14_MASK                     equ 0002h
C1MASK5T_MEID15_POSN                     equ 0002h
C1MASK5T_MEID15_POSITION                 equ 0002h
C1MASK5T_MEID15_SIZE                     equ 0001h
C1MASK5T_MEID15_LENGTH                   equ 0001h
C1MASK5T_MEID15_MASK                     equ 0004h
C1MASK5T_MEID16_POSN                     equ 0003h
C1MASK5T_MEID16_POSITION                 equ 0003h
C1MASK5T_MEID16_SIZE                     equ 0001h
C1MASK5T_MEID16_LENGTH                   equ 0001h
C1MASK5T_MEID16_MASK                     equ 0008h
C1MASK5T_MEID17_POSN                     equ 0004h
C1MASK5T_MEID17_POSITION                 equ 0004h
C1MASK5T_MEID17_SIZE                     equ 0001h
C1MASK5T_MEID17_LENGTH                   equ 0001h
C1MASK5T_MEID17_MASK                     equ 0010h

// Register: C1FLTOBJ6
#define C1FLTOBJ6 C1FLTOBJ6
C1FLTOBJ6                                equ 01BCh

