GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: PWM3ERSPPS
#define PWM3ERSPPS PWM3ERSPPS
PWM3ERSPPS                               equ 0255h
// bitfield definitions
PWM3ERSPPS_PIN_POSN                      equ 0000h
PWM3ERSPPS_PIN_POSITION                  equ 0000h
PWM3ERSPPS_PIN_SIZE                      equ 0003h
PWM3ERSPPS_PIN_LENGTH                    equ 0003h
PWM3ERSPPS_PIN_MASK                      equ 0007h
PWM3ERSPPS_PORT_POSN                     equ 0003h
PWM3ERSPPS_PORT_POSITION                 equ 0003h
PWM3ERSPPS_PORT_SIZE                     equ 0002h
PWM3ERSPPS_PORT_LENGTH                   equ 0002h
PWM3ERSPPS_PORT_MASK                     equ 0018h
PWM3ERSPPS_PWM3ERSPPS_POSN               equ 0000h
PWM3ERSPPS_PWM3ERSPPS_POSITION           equ 0000h
PWM3ERSPPS_PWM3ERSPPS_SIZE               equ 0005h
PWM3ERSPPS_PWM3ERSPPS_LENGTH             equ 0005h
PWM3ERSPPS_PWM3ERSPPS_MASK               equ 001Fh
PWM3ERSPPS_PWM3ERSPPS0_POSN              equ 0000h
PWM3ERSPPS_PWM3ERSPPS0_POSITION          equ 0000h
PWM3ERSPPS_PWM3ERSPPS0_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS0_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS0_MASK              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_POSN              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_POSITION          equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_MASK              equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_POSN              equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_POSITION          equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS2_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS2_MASK              equ 0004h
PWM3ERSPPS_PWM3ERSPPS3_POSN              equ 0003h
PWM3ERSPPS_PWM3ERSPPS3_POSITION          equ 0003h
PWM3ERSPPS_PWM3ERSPPS3_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS3_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS3_MASK              equ 0008h
PWM3ERSPPS_PWM3ERSPPS4_POSN              equ 0004h
PWM3ERSPPS_PWM3ERSPPS4_POSITION          equ 0004h
PWM3ERSPPS_PWM3ERSPPS4_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS4_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS4_MASK              equ 0010h

// Register: PWM4ERSPPS
#define PWM4ERSPPS PWM4ERSPPS
PWM4ERSPPS                               equ 0256h

// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 0257h
// bitfield definitions
PWMIN0PPS_PIN_POSN                       equ 0000h
PWMIN0PPS_PIN_POSITION                   equ 0000h
PWMIN0PPS_PIN_SIZE                       equ 0003h
PWMIN0PPS_PIN_LENGTH                     equ 0003h
PWMIN0PPS_PIN_MASK                       equ 0007h
PWMIN0PPS_PORT_POSN                      equ 0003h
PWMIN0PPS_PORT_POSITION                  equ 0003h
PWMIN0PPS_PORT_SIZE                      equ 0003h
PWMIN0PPS_PORT_LENGTH                    equ 0003h
PWMIN0PPS_PORT_MASK                      equ 0038h
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0006h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0006h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 003Fh
PWMIN0PPS_PWMIN0PPS0_POSN                equ 0000h
PWMIN0PPS_PWMIN0PPS0_POSITION            equ 0000h
PWMIN0PPS_PWMIN0PPS0_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS0_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS0_MASK                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSN                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSITION            equ 0001h
PWMIN0PPS_PWMIN0PPS1_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS1_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS1_MASK                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSN                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSITION            equ 0002h
PWMIN0PPS_PWMIN0PPS2_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS2_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS2_MASK                equ 0004h
PWMIN0PPS_PWMIN0PPS3_POSN                equ 0003h
PWMIN0PPS_PWMIN0PPS3_POSITION            equ 0003h
PWMIN0PPS_PWMIN0PPS3_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS3_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS3_MASK                equ 0008h
PWMIN0PPS_PWMIN0PPS4_POSN                equ 0004h
PWMIN0PPS_PWMIN0PPS4_POSITION            equ 0004h
PWMIN0PPS_PWMIN0PPS4_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS4_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS4_MASK                equ 0010h
PWMIN0PPS_PWMIN0PPS5_POSN                equ 0005h
PWMIN0PPS_PWMIN0PPS5_POSITION            equ 0005h
PWMIN0PPS_PWMIN0PPS5_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS5_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS5_MASK                equ 0020h

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 0258h
// bitfield definitions
PWMIN1PPS_PIN_POSN                       equ 0000h
PWMIN1PPS_PIN_POSITION                   equ 0000h
PWMIN1PPS_PIN_SIZE                       equ 0003h
PWMIN1PPS_PIN_LENGTH                     equ 0003h
PWMIN1PPS_PIN_MASK                       equ 0007h
PWMIN1PPS_PORT_POSN                      equ 0003h
PWMIN1PPS_PORT_POSITION                  equ 0003h
PWMIN1PPS_PORT_SIZE                      equ 0003h
PWMIN1PPS_PORT_LENGTH                    equ 0003h
PWMIN1PPS_PORT_MASK                      equ 0038h
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0006h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0006h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 003Fh
PWMIN1PPS_PWMIN1PPS0_POSN                equ 0000h
PWMIN1PPS_PWMIN1PPS0_POSITION            equ 0000h
PWMIN1PPS_PWMIN1PPS0_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS0_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS0_MASK                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSN                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSITION            equ 0001h
PWMIN1PPS_PWMIN1PPS1_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS1_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS1_MASK                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSN                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSITION            equ 0002h
PWMIN1PPS_PWMIN1PPS2_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS2_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS2_MASK                equ 0004h
PWMIN1PPS_PWMIN1PPS3_POSN                equ 0003h
PWMIN1PPS_PWMIN1PPS3_POSITION            equ 0003h
PWMIN1PPS_PWMIN1PPS3_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS3_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS3_MASK                equ 0008h
PWMIN1PPS_PWMIN1PPS4_POSN                equ 0004h
PWMIN1PPS_PWMIN1PPS4_POSITION            equ 0004h
PWMIN1PPS_PWMIN1PPS4_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS4_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS4_MASK                equ 0010h
PWMIN1PPS_PWMIN1PPS5_POSN                equ 0005h
PWMIN1PPS_PWMIN1PPS5_POSITION            equ 0005h
PWMIN1PPS_PWMIN1PPS5_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS5_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS5_MASK                equ 0020h

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 0259h
// bitfield definitions
SMT1WINPPS_PIN_POSN                      equ 0000h
SMT1WINPPS_PIN_POSITION                  equ 0000h
SMT1WINPPS_PIN_SIZE                      equ 0003h
SMT1WINPPS_PIN_LENGTH                    equ 0003h
SMT1WINPPS_PIN_MASK                      equ 0007h
SMT1WINPPS_PORT_POSN                     equ 0003h
SMT1WINPPS_PORT_POSITION                 equ 0003h
SMT1WINPPS_PORT_SIZE                     equ 0003h
SMT1WINPPS_PORT_LENGTH                   equ 0003h
SMT1WINPPS_PORT_MASK                     equ 0038h
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0006h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0006h
SMT1WINPPS_SMT1WINPPS_MASK               equ 003Fh
SMT1WINPPS_SMT1WINPPS0_POSN              equ 0000h
SMT1WINPPS_SMT1WINPPS0_POSITION          equ 0000h
SMT1WINPPS_SMT1WINPPS0_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS0_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS0_MASK              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSN              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSITION          equ 0001h
SMT1WINPPS_SMT1WINPPS1_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS1_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS1_MASK              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSN              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSITION          equ 0002h
SMT1WINPPS_SMT1WINPPS2_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS2_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS2_MASK              equ 0004h
SMT1WINPPS_SMT1WINPPS3_POSN              equ 0003h
SMT1WINPPS_SMT1WINPPS3_POSITION          equ 0003h
SMT1WINPPS_SMT1WINPPS3_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS3_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS3_MASK              equ 0008h
SMT1WINPPS_SMT1WINPPS4_POSN              equ 0004h
SMT1WINPPS_SMT1WINPPS4_POSITION          equ 0004h
SMT1WINPPS_SMT1WINPPS4_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS4_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS4_MASK              equ 0010h
SMT1WINPPS_SMT1WINPPS5_POSN              equ 0005h
SMT1WINPPS_SMT1WINPPS5_POSITION          equ 0005h
SMT1WINPPS_SMT1WINPPS5_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS5_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS5_MASK              equ 0020h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 025Ah
// bitfield definitions
SMT1SIGPPS_PIN_POSN                      equ 0000h
SMT1SIGPPS_PIN_POSITION                  equ 0000h
SMT1SIGPPS_PIN_SIZE                      equ 0003h
SMT1SIGPPS_PIN_LENGTH                    equ 0003h
SMT1SIGPPS_PIN_MASK                      equ 0007h
SMT1SIGPPS_PORT_POSN                     equ 0003h
SMT1SIGPPS_PORT_POSITION                 equ 0003h
SMT1SIGPPS_PORT_SIZE                     equ 0003h
SMT1SIGPPS_PORT_LENGTH                   equ 0003h
SMT1SIGPPS_PORT_MASK                     equ 0038h
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0006h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0006h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 003Fh
SMT1SIGPPS_SMT1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMT1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMT1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_MASK              equ 0010h
SMT1SIGPPS_SMT1SIGPPS5_POSN              equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_POSITION          equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_MASK              equ 0020h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 025Bh
// bitfield definitions
CWG1PPS_PIN_POSN                         equ 0000h
CWG1PPS_PIN_POSITION                     equ 0000h
CWG1PPS_PIN_SIZE                         equ 0003h
CWG1PPS_PIN_LENGTH                       equ 0003h
CWG1PPS_PIN_MASK                         equ 0007h
CWG1PPS_PORT_POSN                        equ 0003h
CWG1PPS_PORT_POSITION                    equ 0003h
CWG1PPS_PORT_SIZE                        equ 0002h
CWG1PPS_PORT_LENGTH                      equ 0002h
CWG1PPS_PORT_MASK                        equ 0018h
CWG1PPS_CWGINPPS0_POSN                   equ 0000h
CWG1PPS_CWGINPPS0_POSITION               equ 0000h
CWG1PPS_CWGINPPS0_SIZE                   equ 0001h
CWG1PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS0_MASK                   equ 0001h
CWG1PPS_CWGINPPS1_POSN                   equ 0001h
CWG1PPS_CWGINPPS1_POSITION               equ 0001h
CWG1PPS_CWGINPPS1_SIZE                   equ 0001h
CWG1PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS1_MASK                   equ 0002h
CWG1PPS_CWGINPPS2_POSN                   equ 0002h
CWG1PPS_CWGINPPS2_POSITION               equ 0002h
CWG1PPS_CWGINPPS2_SIZE                   equ 0001h
CWG1PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS2_MASK                   equ 0004h
CWG1PPS_CWGINPPS3_POSN                   equ 0003h
CWG1PPS_CWGINPPS3_POSITION               equ 0003h
CWG1PPS_CWGINPPS3_SIZE                   equ 0001h
CWG1PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS3_MASK                   equ 0008h
CWG1PPS_CWGINPPS4_POSN                   equ 0004h
CWG1PPS_CWGINPPS4_POSITION               equ 0004h
CWG1PPS_CWGINPPS4_SIZE                   equ 0001h
CWG1PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS4_MASK                   equ 0010h
CWG1PPS_CWG1INPPS_POSN                   equ 0000h
CWG1PPS_CWG1INPPS_POSITION               equ 0000h
CWG1PPS_CWG1INPPS_SIZE                   equ 0005h
CWG1PPS_CWG1INPPS_LENGTH                 equ 0005h
CWG1PPS_CWG1INPPS_MASK                   equ 001Fh
CWG1PPS_CWG1INPPS0_POSN                  equ 0000h
CWG1PPS_CWG1INPPS0_POSITION              equ 0000h
CWG1PPS_CWG1INPPS0_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS0_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS0_MASK                  equ 0001h
CWG1PPS_CWG1INPPS1_POSN                  equ 0001h
CWG1PPS_CWG1INPPS1_POSITION              equ 0001h
CWG1PPS_CWG1INPPS1_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS1_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS1_MASK                  equ 0002h
CWG1PPS_CWG1INPPS2_POSN                  equ 0002h
CWG1PPS_CWG1INPPS2_POSITION              equ 0002h
CWG1PPS_CWG1INPPS2_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS2_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS2_MASK                  equ 0004h
CWG1PPS_CWG1INPPS3_POSN                  equ 0003h
CWG1PPS_CWG1INPPS3_POSITION              equ 0003h
CWG1PPS_CWG1INPPS3_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS3_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS3_MASK                  equ 0008h
CWG1PPS_CWG1INPPS4_POSN                  equ 0004h
CWG1PPS_CWG1INPPS4_POSITION              equ 0004h
CWG1PPS_CWG1INPPS4_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS4_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS4_MASK                  equ 0010h
CWG1PPS_CWGINPPS_POSN                    equ 0000h
CWG1PPS_CWGINPPS_POSITION                equ 0000h
CWG1PPS_CWGINPPS_SIZE                    equ 0005h
CWG1PPS_CWGINPPS_LENGTH                  equ 0005h
CWG1PPS_CWGINPPS_MASK                    equ 001Fh

