GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
I2C1SDAPPS                               equ 0270h
// bitfield definitions
I2C1SDAPPS_PIN_POSN                      equ 0000h
I2C1SDAPPS_PIN_POSITION                  equ 0000h
I2C1SDAPPS_PIN_SIZE                      equ 0003h
I2C1SDAPPS_PIN_LENGTH                    equ 0003h
I2C1SDAPPS_PIN_MASK                      equ 0007h
I2C1SDAPPS_PORT_POSN                     equ 0003h
I2C1SDAPPS_PORT_POSITION                 equ 0003h
I2C1SDAPPS_PORT_SIZE                     equ 0002h
I2C1SDAPPS_PORT_LENGTH                   equ 0002h
I2C1SDAPPS_PORT_MASK                     equ 0018h
I2C1SDAPPS_I2C1SDAPPS_POSN               equ 0000h
I2C1SDAPPS_I2C1SDAPPS_POSITION           equ 0000h
I2C1SDAPPS_I2C1SDAPPS_SIZE               equ 0005h
I2C1SDAPPS_I2C1SDAPPS_LENGTH             equ 0005h
I2C1SDAPPS_I2C1SDAPPS_MASK               equ 001Fh
I2C1SDAPPS_I2C1SDAPPS0_POSN              equ 0000h
I2C1SDAPPS_I2C1SDAPPS0_POSITION          equ 0000h
I2C1SDAPPS_I2C1SDAPPS0_SIZE              equ 0001h
I2C1SDAPPS_I2C1SDAPPS0_LENGTH            equ 0001h
I2C1SDAPPS_I2C1SDAPPS0_MASK              equ 0001h
I2C1SDAPPS_I2C1SDAPPS1_POSN              equ 0001h
I2C1SDAPPS_I2C1SDAPPS1_POSITION          equ 0001h
I2C1SDAPPS_I2C1SDAPPS1_SIZE              equ 0001h
I2C1SDAPPS_I2C1SDAPPS1_LENGTH            equ 0001h
I2C1SDAPPS_I2C1SDAPPS1_MASK              equ 0002h
I2C1SDAPPS_I2C1SDAPPS2_POSN              equ 0002h
I2C1SDAPPS_I2C1SDAPPS2_POSITION          equ 0002h
I2C1SDAPPS_I2C1SDAPPS2_SIZE              equ 0001h
I2C1SDAPPS_I2C1SDAPPS2_LENGTH            equ 0001h
I2C1SDAPPS_I2C1SDAPPS2_MASK              equ 0004h
I2C1SDAPPS_I2C1SDAPPS3_POSN              equ 0003h
I2C1SDAPPS_I2C1SDAPPS3_POSITION          equ 0003h
I2C1SDAPPS_I2C1SDAPPS3_SIZE              equ 0001h
I2C1SDAPPS_I2C1SDAPPS3_LENGTH            equ 0001h
I2C1SDAPPS_I2C1SDAPPS3_MASK              equ 0008h
I2C1SDAPPS_I2C1SDAPPS4_POSN              equ 0004h
I2C1SDAPPS_I2C1SDAPPS4_POSITION          equ 0004h
I2C1SDAPPS_I2C1SDAPPS4_SIZE              equ 0001h
I2C1SDAPPS_I2C1SDAPPS4_LENGTH            equ 0001h
I2C1SDAPPS_I2C1SDAPPS4_MASK              equ 0010h

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
I2C1SCLPPS                               equ 0271h
// bitfield definitions
I2C1SCLPPS_PIN_POSN                      equ 0000h
I2C1SCLPPS_PIN_POSITION                  equ 0000h
I2C1SCLPPS_PIN_SIZE                      equ 0003h
I2C1SCLPPS_PIN_LENGTH                    equ 0003h
I2C1SCLPPS_PIN_MASK                      equ 0007h
I2C1SCLPPS_PORT_POSN                     equ 0003h
I2C1SCLPPS_PORT_POSITION                 equ 0003h
I2C1SCLPPS_PORT_SIZE                     equ 0002h
I2C1SCLPPS_PORT_LENGTH                   equ 0002h
I2C1SCLPPS_PORT_MASK                     equ 0018h
I2C1SCLPPS_I2C1SCLPPS_POSN               equ 0000h
I2C1SCLPPS_I2C1SCLPPS_POSITION           equ 0000h
I2C1SCLPPS_I2C1SCLPPS_SIZE               equ 0005h
I2C1SCLPPS_I2C1SCLPPS_LENGTH             equ 0005h
I2C1SCLPPS_I2C1SCLPPS_MASK               equ 001Fh
I2C1SCLPPS_I2C1SCLPPS0_POSN              equ 0000h
I2C1SCLPPS_I2C1SCLPPS0_POSITION          equ 0000h
I2C1SCLPPS_I2C1SCLPPS0_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS0_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS0_MASK              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_POSN              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_POSITION          equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_MASK              equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_POSN              equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_POSITION          equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS2_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS2_MASK              equ 0004h
I2C1SCLPPS_I2C1SCLPPS3_POSN              equ 0003h
I2C1SCLPPS_I2C1SCLPPS3_POSITION          equ 0003h
I2C1SCLPPS_I2C1SCLPPS3_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS3_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS3_MASK              equ 0008h
I2C1SCLPPS_I2C1SCLPPS4_POSN              equ 0004h
I2C1SCLPPS_I2C1SCLPPS4_POSITION          equ 0004h
I2C1SCLPPS_I2C1SCLPPS4_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS4_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS4_MASK              equ 0010h

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
U1RXPPS                                  equ 0272h
// bitfield definitions
U1RXPPS_PIN_POSN                         equ 0000h
U1RXPPS_PIN_POSITION                     equ 0000h
U1RXPPS_PIN_SIZE                         equ 0003h
U1RXPPS_PIN_LENGTH                       equ 0003h
U1RXPPS_PIN_MASK                         equ 0007h
U1RXPPS_PORT_POSN                        equ 0003h
U1RXPPS_PORT_POSITION                    equ 0003h
U1RXPPS_PORT_SIZE                        equ 0003h
U1RXPPS_PORT_LENGTH                      equ 0003h
U1RXPPS_PORT_MASK                        equ 0038h
U1RXPPS_U1RXPPS_POSN                     equ 0000h
U1RXPPS_U1RXPPS_POSITION                 equ 0000h
U1RXPPS_U1RXPPS_SIZE                     equ 0006h
U1RXPPS_U1RXPPS_LENGTH                   equ 0006h
U1RXPPS_U1RXPPS_MASK                     equ 003Fh
U1RXPPS_U1RXPPS0_POSN                    equ 0000h
U1RXPPS_U1RXPPS0_POSITION                equ 0000h
U1RXPPS_U1RXPPS0_SIZE                    equ 0001h
U1RXPPS_U1RXPPS0_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS0_MASK                    equ 0001h
U1RXPPS_U1RXPPS1_POSN                    equ 0001h
U1RXPPS_U1RXPPS1_POSITION                equ 0001h
U1RXPPS_U1RXPPS1_SIZE                    equ 0001h
U1RXPPS_U1RXPPS1_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS1_MASK                    equ 0002h
U1RXPPS_U1RXPPS2_POSN                    equ 0002h
U1RXPPS_U1RXPPS2_POSITION                equ 0002h
U1RXPPS_U1RXPPS2_SIZE                    equ 0001h
U1RXPPS_U1RXPPS2_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS2_MASK                    equ 0004h
U1RXPPS_U1RXPPS3_POSN                    equ 0003h
U1RXPPS_U1RXPPS3_POSITION                equ 0003h
U1RXPPS_U1RXPPS3_SIZE                    equ 0001h
U1RXPPS_U1RXPPS3_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS3_MASK                    equ 0008h
U1RXPPS_U1RXPPS4_POSN                    equ 0004h
U1RXPPS_U1RXPPS4_POSITION                equ 0004h
U1RXPPS_U1RXPPS4_SIZE                    equ 0001h
U1RXPPS_U1RXPPS4_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS4_MASK                    equ 0010h
U1RXPPS_U1RXPPS5_POSN                    equ 0005h
U1RXPPS_U1RXPPS5_POSITION                equ 0005h
U1RXPPS_U1RXPPS5_SIZE                    equ 0001h
U1RXPPS_U1RXPPS5_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS5_MASK                    equ 0020h

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
U1CTSPPS                                 equ 0273h
// bitfield definitions
U1CTSPPS_PIN_POSN                        equ 0000h
U1CTSPPS_PIN_POSITION                    equ 0000h
U1CTSPPS_PIN_SIZE                        equ 0003h
U1CTSPPS_PIN_LENGTH                      equ 0003h
U1CTSPPS_PIN_MASK                        equ 0007h
U1CTSPPS_PORT_POSN                       equ 0003h
U1CTSPPS_PORT_POSITION                   equ 0003h
U1CTSPPS_PORT_SIZE                       equ 0003h
U1CTSPPS_PORT_LENGTH                     equ 0003h
U1CTSPPS_PORT_MASK                       equ 0038h
U1CTSPPS_U1CTSPPS_POSN                   equ 0000h
U1CTSPPS_U1CTSPPS_POSITION               equ 0000h
U1CTSPPS_U1CTSPPS_SIZE                   equ 0006h
U1CTSPPS_U1CTSPPS_LENGTH                 equ 0006h
U1CTSPPS_U1CTSPPS_MASK                   equ 003Fh
U1CTSPPS_U1CTSPPS0_POSN                  equ 0000h
U1CTSPPS_U1CTSPPS0_POSITION              equ 0000h
U1CTSPPS_U1CTSPPS0_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS0_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS0_MASK                  equ 0001h
U1CTSPPS_U1CTSPPS1_POSN                  equ 0001h
U1CTSPPS_U1CTSPPS1_POSITION              equ 0001h
U1CTSPPS_U1CTSPPS1_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS1_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS1_MASK                  equ 0002h
U1CTSPPS_U1CTSPPS2_POSN                  equ 0002h
U1CTSPPS_U1CTSPPS2_POSITION              equ 0002h
U1CTSPPS_U1CTSPPS2_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS2_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS2_MASK                  equ 0004h
U1CTSPPS_U1CTSPPS3_POSN                  equ 0003h
U1CTSPPS_U1CTSPPS3_POSITION              equ 0003h
U1CTSPPS_U1CTSPPS3_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS3_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS3_MASK                  equ 0008h
U1CTSPPS_U1CTSPPS4_POSN                  equ 0004h
U1CTSPPS_U1CTSPPS4_POSITION              equ 0004h
U1CTSPPS_U1CTSPPS4_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS4_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS4_MASK                  equ 0010h
U1CTSPPS_U1CTSPPS5_POSN                  equ 0005h
U1CTSPPS_U1CTSPPS5_POSITION              equ 0005h
U1CTSPPS_U1CTSPPS5_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS5_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS5_MASK                  equ 0020h

