GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: U1ERRIR
#define U1ERRIR U1ERRIR
U1ERRIR                                  equ 02B2h
// bitfield definitions
U1ERRIR_TXCIF_POSN                       equ 0000h
U1ERRIR_TXCIF_POSITION                   equ 0000h
U1ERRIR_TXCIF_SIZE                       equ 0001h
U1ERRIR_TXCIF_LENGTH                     equ 0001h
U1ERRIR_TXCIF_MASK                       equ 0001h
U1ERRIR_RXFOIF_POSN                      equ 0001h
U1ERRIR_RXFOIF_POSITION                  equ 0001h
U1ERRIR_RXFOIF_SIZE                      equ 0001h
U1ERRIR_RXFOIF_LENGTH                    equ 0001h
U1ERRIR_RXFOIF_MASK                      equ 0002h
U1ERRIR_RXBKIF_POSN                      equ 0002h
U1ERRIR_RXBKIF_POSITION                  equ 0002h
U1ERRIR_RXBKIF_SIZE                      equ 0001h
U1ERRIR_RXBKIF_LENGTH                    equ 0001h
U1ERRIR_RXBKIF_MASK                      equ 0004h
U1ERRIR_FERIF_POSN                       equ 0003h
U1ERRIR_FERIF_POSITION                   equ 0003h
U1ERRIR_FERIF_SIZE                       equ 0001h
U1ERRIR_FERIF_LENGTH                     equ 0001h
U1ERRIR_FERIF_MASK                       equ 0008h
U1ERRIR_CERIF_POSN                       equ 0004h
U1ERRIR_CERIF_POSITION                   equ 0004h
U1ERRIR_CERIF_SIZE                       equ 0001h
U1ERRIR_CERIF_LENGTH                     equ 0001h
U1ERRIR_CERIF_MASK                       equ 0010h
U1ERRIR_ABDOVF_POSN                      equ 0005h
U1ERRIR_ABDOVF_POSITION                  equ 0005h
U1ERRIR_ABDOVF_SIZE                      equ 0001h
U1ERRIR_ABDOVF_LENGTH                    equ 0001h
U1ERRIR_ABDOVF_MASK                      equ 0020h
U1ERRIR_PERIF_POSN                       equ 0006h
U1ERRIR_PERIF_POSITION                   equ 0006h
U1ERRIR_PERIF_SIZE                       equ 0001h
U1ERRIR_PERIF_LENGTH                     equ 0001h
U1ERRIR_PERIF_MASK                       equ 0040h
U1ERRIR_TXMTIF_POSN                      equ 0007h
U1ERRIR_TXMTIF_POSITION                  equ 0007h
U1ERRIR_TXMTIF_SIZE                      equ 0001h
U1ERRIR_TXMTIF_LENGTH                    equ 0001h
U1ERRIR_TXMTIF_MASK                      equ 0080h
U1ERRIR_U1TXCIF_POSN                     equ 0000h
U1ERRIR_U1TXCIF_POSITION                 equ 0000h
U1ERRIR_U1TXCIF_SIZE                     equ 0001h
U1ERRIR_U1TXCIF_LENGTH                   equ 0001h
U1ERRIR_U1TXCIF_MASK                     equ 0001h
U1ERRIR_U1RXFOIF_POSN                    equ 0001h
U1ERRIR_U1RXFOIF_POSITION                equ 0001h
U1ERRIR_U1RXFOIF_SIZE                    equ 0001h
U1ERRIR_U1RXFOIF_LENGTH                  equ 0001h
U1ERRIR_U1RXFOIF_MASK                    equ 0002h
U1ERRIR_U1RXBKIF_POSN                    equ 0002h
U1ERRIR_U1RXBKIF_POSITION                equ 0002h
U1ERRIR_U1RXBKIF_SIZE                    equ 0001h
U1ERRIR_U1RXBKIF_LENGTH                  equ 0001h
U1ERRIR_U1RXBKIF_MASK                    equ 0004h
U1ERRIR_U1FERIF_POSN                     equ 0003h
U1ERRIR_U1FERIF_POSITION                 equ 0003h
U1ERRIR_U1FERIF_SIZE                     equ 0001h
U1ERRIR_U1FERIF_LENGTH                   equ 0001h
U1ERRIR_U1FERIF_MASK                     equ 0008h
U1ERRIR_U1CERIF_POSN                     equ 0004h
U1ERRIR_U1CERIF_POSITION                 equ 0004h
U1ERRIR_U1CERIF_SIZE                     equ 0001h
U1ERRIR_U1CERIF_LENGTH                   equ 0001h
U1ERRIR_U1CERIF_MASK                     equ 0010h
U1ERRIR_U1ABDOVF_POSN                    equ 0005h
U1ERRIR_U1ABDOVF_POSITION                equ 0005h
U1ERRIR_U1ABDOVF_SIZE                    equ 0001h
U1ERRIR_U1ABDOVF_LENGTH                  equ 0001h
U1ERRIR_U1ABDOVF_MASK                    equ 0020h
U1ERRIR_U1PERIF_POSN                     equ 0006h
U1ERRIR_U1PERIF_POSITION                 equ 0006h
U1ERRIR_U1PERIF_SIZE                     equ 0001h
U1ERRIR_U1PERIF_LENGTH                   equ 0001h
U1ERRIR_U1PERIF_MASK                     equ 0040h
U1ERRIR_U1TXMTIF_POSN                    equ 0007h
U1ERRIR_U1TXMTIF_POSITION                equ 0007h
U1ERRIR_U1TXMTIF_SIZE                    equ 0001h
U1ERRIR_U1TXMTIF_LENGTH                  equ 0001h
U1ERRIR_U1TXMTIF_MASK                    equ 0080h

// Register: U1ERRIE
#define U1ERRIE U1ERRIE
U1ERRIE                                  equ 02B3h
// bitfield definitions
U1ERRIE_TXCIE_POSN                       equ 0000h
U1ERRIE_TXCIE_POSITION                   equ 0000h
U1ERRIE_TXCIE_SIZE                       equ 0001h
U1ERRIE_TXCIE_LENGTH                     equ 0001h
U1ERRIE_TXCIE_MASK                       equ 0001h
U1ERRIE_RXFOIE_POSN                      equ 0001h
U1ERRIE_RXFOIE_POSITION                  equ 0001h
U1ERRIE_RXFOIE_SIZE                      equ 0001h
U1ERRIE_RXFOIE_LENGTH                    equ 0001h
U1ERRIE_RXFOIE_MASK                      equ 0002h
U1ERRIE_RXBKIE_POSN                      equ 0002h
U1ERRIE_RXBKIE_POSITION                  equ 0002h
U1ERRIE_RXBKIE_SIZE                      equ 0001h
U1ERRIE_RXBKIE_LENGTH                    equ 0001h
U1ERRIE_RXBKIE_MASK                      equ 0004h
U1ERRIE_FERIE_POSN                       equ 0003h
U1ERRIE_FERIE_POSITION                   equ 0003h
U1ERRIE_FERIE_SIZE                       equ 0001h
U1ERRIE_FERIE_LENGTH                     equ 0001h
U1ERRIE_FERIE_MASK                       equ 0008h
U1ERRIE_CERIE_POSN                       equ 0004h
U1ERRIE_CERIE_POSITION                   equ 0004h
U1ERRIE_CERIE_SIZE                       equ 0001h
U1ERRIE_CERIE_LENGTH                     equ 0001h
U1ERRIE_CERIE_MASK                       equ 0010h
U1ERRIE_ABDOVE_POSN                      equ 0005h
U1ERRIE_ABDOVE_POSITION                  equ 0005h
U1ERRIE_ABDOVE_SIZE                      equ 0001h
U1ERRIE_ABDOVE_LENGTH                    equ 0001h
U1ERRIE_ABDOVE_MASK                      equ 0020h
U1ERRIE_PERIE_POSN                       equ 0006h
U1ERRIE_PERIE_POSITION                   equ 0006h
U1ERRIE_PERIE_SIZE                       equ 0001h
U1ERRIE_PERIE_LENGTH                     equ 0001h
U1ERRIE_PERIE_MASK                       equ 0040h
U1ERRIE_TXMTIE_POSN                      equ 0007h
U1ERRIE_TXMTIE_POSITION                  equ 0007h
U1ERRIE_TXMTIE_SIZE                      equ 0001h
U1ERRIE_TXMTIE_LENGTH                    equ 0001h
U1ERRIE_TXMTIE_MASK                      equ 0080h
U1ERRIE_U1TXCIE_POSN                     equ 0000h
U1ERRIE_U1TXCIE_POSITION                 equ 0000h
U1ERRIE_U1TXCIE_SIZE                     equ 0001h
U1ERRIE_U1TXCIE_LENGTH                   equ 0001h
U1ERRIE_U1TXCIE_MASK                     equ 0001h
U1ERRIE_U1RXFOIE_POSN                    equ 0001h
U1ERRIE_U1RXFOIE_POSITION                equ 0001h
U1ERRIE_U1RXFOIE_SIZE                    equ 0001h
U1ERRIE_U1RXFOIE_LENGTH                  equ 0001h
U1ERRIE_U1RXFOIE_MASK                    equ 0002h
U1ERRIE_U1RXBKIE_POSN                    equ 0002h
U1ERRIE_U1RXBKIE_POSITION                equ 0002h
U1ERRIE_U1RXBKIE_SIZE                    equ 0001h
U1ERRIE_U1RXBKIE_LENGTH                  equ 0001h
U1ERRIE_U1RXBKIE_MASK                    equ 0004h
U1ERRIE_U1FERIE_POSN                     equ 0003h
U1ERRIE_U1FERIE_POSITION                 equ 0003h
U1ERRIE_U1FERIE_SIZE                     equ 0001h
U1ERRIE_U1FERIE_LENGTH                   equ 0001h
U1ERRIE_U1FERIE_MASK                     equ 0008h
U1ERRIE_U1CERIE_POSN                     equ 0004h
U1ERRIE_U1CERIE_POSITION                 equ 0004h
U1ERRIE_U1CERIE_SIZE                     equ 0001h
U1ERRIE_U1CERIE_LENGTH                   equ 0001h
U1ERRIE_U1CERIE_MASK                     equ 0010h
U1ERRIE_U1ABDOVE_POSN                    equ 0005h
U1ERRIE_U1ABDOVE_POSITION                equ 0005h
U1ERRIE_U1ABDOVE_SIZE                    equ 0001h
U1ERRIE_U1ABDOVE_LENGTH                  equ 0001h
U1ERRIE_U1ABDOVE_MASK                    equ 0020h
U1ERRIE_U1PERIE_POSN                     equ 0006h
U1ERRIE_U1PERIE_POSITION                 equ 0006h
U1ERRIE_U1PERIE_SIZE                     equ 0001h
U1ERRIE_U1PERIE_LENGTH                   equ 0001h
U1ERRIE_U1PERIE_MASK                     equ 0040h
U1ERRIE_U1TXMTIE_POSN                    equ 0007h
U1ERRIE_U1TXMTIE_POSITION                equ 0007h
U1ERRIE_U1TXMTIE_SIZE                    equ 0001h
U1ERRIE_U1TXMTIE_LENGTH                  equ 0001h
U1ERRIE_U1TXMTIE_MASK                    equ 0080h

