GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
CWG3CON0                                 equ 03D2h
// bitfield definitions
CWG3CON0_MODE_POSN                       equ 0000h
CWG3CON0_MODE_POSITION                   equ 0000h
CWG3CON0_MODE_SIZE                       equ 0003h
CWG3CON0_MODE_LENGTH                     equ 0003h
CWG3CON0_MODE_MASK                       equ 0007h
CWG3CON0_LD_POSN                         equ 0006h
CWG3CON0_LD_POSITION                     equ 0006h
CWG3CON0_LD_SIZE                         equ 0001h
CWG3CON0_LD_LENGTH                       equ 0001h
CWG3CON0_LD_MASK                         equ 0040h
CWG3CON0_EN_POSN                         equ 0007h
CWG3CON0_EN_POSITION                     equ 0007h
CWG3CON0_EN_SIZE                         equ 0001h
CWG3CON0_EN_LENGTH                       equ 0001h
CWG3CON0_EN_MASK                         equ 0080h
CWG3CON0_MODE0_POSN                      equ 0000h
CWG3CON0_MODE0_POSITION                  equ 0000h
CWG3CON0_MODE0_SIZE                      equ 0001h
CWG3CON0_MODE0_LENGTH                    equ 0001h
CWG3CON0_MODE0_MASK                      equ 0001h
CWG3CON0_MODE1_POSN                      equ 0001h
CWG3CON0_MODE1_POSITION                  equ 0001h
CWG3CON0_MODE1_SIZE                      equ 0001h
CWG3CON0_MODE1_LENGTH                    equ 0001h
CWG3CON0_MODE1_MASK                      equ 0002h
CWG3CON0_MODE2_POSN                      equ 0002h
CWG3CON0_MODE2_POSITION                  equ 0002h
CWG3CON0_MODE2_SIZE                      equ 0001h
CWG3CON0_MODE2_LENGTH                    equ 0001h
CWG3CON0_MODE2_MASK                      equ 0004h
CWG3CON0_G3EN_POSN                       equ 0007h
CWG3CON0_G3EN_POSITION                   equ 0007h
CWG3CON0_G3EN_SIZE                       equ 0001h
CWG3CON0_G3EN_LENGTH                     equ 0001h
CWG3CON0_G3EN_MASK                       equ 0080h
CWG3CON0_CWG3MODE_POSN                   equ 0000h
CWG3CON0_CWG3MODE_POSITION               equ 0000h
CWG3CON0_CWG3MODE_SIZE                   equ 0003h
CWG3CON0_CWG3MODE_LENGTH                 equ 0003h
CWG3CON0_CWG3MODE_MASK                   equ 0007h
CWG3CON0_CWG3LD_POSN                     equ 0006h
CWG3CON0_CWG3LD_POSITION                 equ 0006h
CWG3CON0_CWG3LD_SIZE                     equ 0001h
CWG3CON0_CWG3LD_LENGTH                   equ 0001h
CWG3CON0_CWG3LD_MASK                     equ 0040h
CWG3CON0_CWG3EN_POSN                     equ 0007h
CWG3CON0_CWG3EN_POSITION                 equ 0007h
CWG3CON0_CWG3EN_SIZE                     equ 0001h
CWG3CON0_CWG3EN_LENGTH                   equ 0001h
CWG3CON0_CWG3EN_MASK                     equ 0080h
CWG3CON0_CWG3MODE0_POSN                  equ 0000h
CWG3CON0_CWG3MODE0_POSITION              equ 0000h
CWG3CON0_CWG3MODE0_SIZE                  equ 0001h
CWG3CON0_CWG3MODE0_LENGTH                equ 0001h
CWG3CON0_CWG3MODE0_MASK                  equ 0001h
CWG3CON0_CWG3MODE1_POSN                  equ 0001h
CWG3CON0_CWG3MODE1_POSITION              equ 0001h
CWG3CON0_CWG3MODE1_SIZE                  equ 0001h
CWG3CON0_CWG3MODE1_LENGTH                equ 0001h
CWG3CON0_CWG3MODE1_MASK                  equ 0002h
CWG3CON0_CWG3MODE2_POSN                  equ 0002h
CWG3CON0_CWG3MODE2_POSITION              equ 0002h
CWG3CON0_CWG3MODE2_SIZE                  equ 0001h
CWG3CON0_CWG3MODE2_LENGTH                equ 0001h
CWG3CON0_CWG3MODE2_MASK                  equ 0004h

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
CWG3CON1                                 equ 03D3h
// bitfield definitions
CWG3CON1_POLA_POSN                       equ 0000h
CWG3CON1_POLA_POSITION                   equ 0000h
CWG3CON1_POLA_SIZE                       equ 0001h
CWG3CON1_POLA_LENGTH                     equ 0001h
CWG3CON1_POLA_MASK                       equ 0001h
CWG3CON1_POLB_POSN                       equ 0001h
CWG3CON1_POLB_POSITION                   equ 0001h
CWG3CON1_POLB_SIZE                       equ 0001h
CWG3CON1_POLB_LENGTH                     equ 0001h
CWG3CON1_POLB_MASK                       equ 0002h
CWG3CON1_POLC_POSN                       equ 0002h
CWG3CON1_POLC_POSITION                   equ 0002h
CWG3CON1_POLC_SIZE                       equ 0001h
CWG3CON1_POLC_LENGTH                     equ 0001h
CWG3CON1_POLC_MASK                       equ 0004h
CWG3CON1_POLD_POSN                       equ 0003h
CWG3CON1_POLD_POSITION                   equ 0003h
CWG3CON1_POLD_SIZE                       equ 0001h
CWG3CON1_POLD_LENGTH                     equ 0001h
CWG3CON1_POLD_MASK                       equ 0008h
CWG3CON1_IN_POSN                         equ 0005h
CWG3CON1_IN_POSITION                     equ 0005h
CWG3CON1_IN_SIZE                         equ 0001h
CWG3CON1_IN_LENGTH                       equ 0001h
CWG3CON1_IN_MASK                         equ 0020h
CWG3CON1_CWG3POLA_POSN                   equ 0000h
CWG3CON1_CWG3POLA_POSITION               equ 0000h
CWG3CON1_CWG3POLA_SIZE                   equ 0001h
CWG3CON1_CWG3POLA_LENGTH                 equ 0001h
CWG3CON1_CWG3POLA_MASK                   equ 0001h
CWG3CON1_CWG3POLB_POSN                   equ 0001h
CWG3CON1_CWG3POLB_POSITION               equ 0001h
CWG3CON1_CWG3POLB_SIZE                   equ 0001h
CWG3CON1_CWG3POLB_LENGTH                 equ 0001h
CWG3CON1_CWG3POLB_MASK                   equ 0002h
CWG3CON1_CWG3POLC_POSN                   equ 0002h
CWG3CON1_CWG3POLC_POSITION               equ 0002h
CWG3CON1_CWG3POLC_SIZE                   equ 0001h
CWG3CON1_CWG3POLC_LENGTH                 equ 0001h
CWG3CON1_CWG3POLC_MASK                   equ 0004h
CWG3CON1_CWG3POLD_POSN                   equ 0003h
CWG3CON1_CWG3POLD_POSITION               equ 0003h
CWG3CON1_CWG3POLD_SIZE                   equ 0001h
CWG3CON1_CWG3POLD_LENGTH                 equ 0001h
CWG3CON1_CWG3POLD_MASK                   equ 0008h
CWG3CON1_CWG3IN_POSN                     equ 0005h
CWG3CON1_CWG3IN_POSITION                 equ 0005h
CWG3CON1_CWG3IN_SIZE                     equ 0001h
CWG3CON1_CWG3IN_LENGTH                   equ 0001h
CWG3CON1_CWG3IN_MASK                     equ 0020h

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
CWG3AS0                                  equ 03D4h
// bitfield definitions
CWG3AS0_LSAC_POSN                        equ 0002h
CWG3AS0_LSAC_POSITION                    equ 0002h
CWG3AS0_LSAC_SIZE                        equ 0002h
CWG3AS0_LSAC_LENGTH                      equ 0002h
CWG3AS0_LSAC_MASK                        equ 000Ch
CWG3AS0_LSBD_POSN                        equ 0004h
CWG3AS0_LSBD_POSITION                    equ 0004h
CWG3AS0_LSBD_SIZE                        equ 0002h
CWG3AS0_LSBD_LENGTH                      equ 0002h
CWG3AS0_LSBD_MASK                        equ 0030h
CWG3AS0_REN_POSN                         equ 0006h
CWG3AS0_REN_POSITION                     equ 0006h
CWG3AS0_REN_SIZE                         equ 0001h
CWG3AS0_REN_LENGTH                       equ 0001h
CWG3AS0_REN_MASK                         equ 0040h
CWG3AS0_SHUTDOWN_POSN                    equ 0007h
CWG3AS0_SHUTDOWN_POSITION                equ 0007h
CWG3AS0_SHUTDOWN_SIZE                    equ 0001h
CWG3AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG3AS0_SHUTDOWN_MASK                    equ 0080h
CWG3AS0_LSAC0_POSN                       equ 0002h
CWG3AS0_LSAC0_POSITION                   equ 0002h
CWG3AS0_LSAC0_SIZE                       equ 0001h
CWG3AS0_LSAC0_LENGTH                     equ 0001h
CWG3AS0_LSAC0_MASK                       equ 0004h
CWG3AS0_LSAC1_POSN                       equ 0003h
CWG3AS0_LSAC1_POSITION                   equ 0003h
CWG3AS0_LSAC1_SIZE                       equ 0001h
CWG3AS0_LSAC1_LENGTH                     equ 0001h
CWG3AS0_LSAC1_MASK                       equ 0008h
CWG3AS0_LSBD0_POSN                       equ 0004h
CWG3AS0_LSBD0_POSITION                   equ 0004h
CWG3AS0_LSBD0_SIZE                       equ 0001h
CWG3AS0_LSBD0_LENGTH                     equ 0001h
CWG3AS0_LSBD0_MASK                       equ 0010h
CWG3AS0_LSBD1_POSN                       equ 0005h
CWG3AS0_LSBD1_POSITION                   equ 0005h
CWG3AS0_LSBD1_SIZE                       equ 0001h
CWG3AS0_LSBD1_LENGTH                     equ 0001h
CWG3AS0_LSBD1_MASK                       equ 0020h
CWG3AS0_CWG3LSAC_POSN                    equ 0002h
CWG3AS0_CWG3LSAC_POSITION                equ 0002h
CWG3AS0_CWG3LSAC_SIZE                    equ 0002h
CWG3AS0_CWG3LSAC_LENGTH                  equ 0002h
CWG3AS0_CWG3LSAC_MASK                    equ 000Ch
CWG3AS0_CWG3LSBD_POSN                    equ 0004h
CWG3AS0_CWG3LSBD_POSITION                equ 0004h
CWG3AS0_CWG3LSBD_SIZE                    equ 0002h
CWG3AS0_CWG3LSBD_LENGTH                  equ 0002h
CWG3AS0_CWG3LSBD_MASK                    equ 0030h
CWG3AS0_CWG3REN_POSN                     equ 0006h
CWG3AS0_CWG3REN_POSITION                 equ 0006h
CWG3AS0_CWG3REN_SIZE                     equ 0001h
CWG3AS0_CWG3REN_LENGTH                   equ 0001h
CWG3AS0_CWG3REN_MASK                     equ 0040h
CWG3AS0_CWG3SHUTDOWN_POSN                equ 0007h
CWG3AS0_CWG3SHUTDOWN_POSITION            equ 0007h
CWG3AS0_CWG3SHUTDOWN_SIZE                equ 0001h
CWG3AS0_CWG3SHUTDOWN_LENGTH              equ 0001h
CWG3AS0_CWG3SHUTDOWN_MASK                equ 0080h
CWG3AS0_CWG3LSAC0_POSN                   equ 0002h
CWG3AS0_CWG3LSAC0_POSITION               equ 0002h
CWG3AS0_CWG3LSAC0_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC0_MASK                   equ 0004h
CWG3AS0_CWG3LSAC1_POSN                   equ 0003h
CWG3AS0_CWG3LSAC1_POSITION               equ 0003h
CWG3AS0_CWG3LSAC1_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC1_MASK                   equ 0008h
CWG3AS0_CWG3LSBD0_POSN                   equ 0004h
CWG3AS0_CWG3LSBD0_POSITION               equ 0004h
CWG3AS0_CWG3LSBD0_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD0_MASK                   equ 0010h
CWG3AS0_CWG3LSBD1_POSN                   equ 0005h
CWG3AS0_CWG3LSBD1_POSITION               equ 0005h
CWG3AS0_CWG3LSBD1_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD1_MASK                   equ 0020h

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
CWG3AS1                                  equ 03D5h
// bitfield definitions
CWG3AS1_AS0E_POSN                        equ 0000h
CWG3AS1_AS0E_POSITION                    equ 0000h
CWG3AS1_AS0E_SIZE                        equ 0001h
CWG3AS1_AS0E_LENGTH                      equ 0001h
CWG3AS1_AS0E_MASK                        equ 0001h
CWG3AS1_AS1E_POSN                        equ 0001h
CWG3AS1_AS1E_POSITION                    equ 0001h
CWG3AS1_AS1E_SIZE                        equ 0001h
CWG3AS1_AS1E_LENGTH                      equ 0001h
CWG3AS1_AS1E_MASK                        equ 0002h
CWG3AS1_AS2E_POSN                        equ 0002h
CWG3AS1_AS2E_POSITION                    equ 0002h
CWG3AS1_AS2E_SIZE                        equ 0001h
CWG3AS1_AS2E_LENGTH                      equ 0001h
CWG3AS1_AS2E_MASK                        equ 0004h
CWG3AS1_AS3E_POSN                        equ 0003h
CWG3AS1_AS3E_POSITION                    equ 0003h
CWG3AS1_AS3E_SIZE                        equ 0001h
CWG3AS1_AS3E_LENGTH                      equ 0001h
CWG3AS1_AS3E_MASK                        equ 0008h
CWG3AS1_AS4E_POSN                        equ 0004h
CWG3AS1_AS4E_POSITION                    equ 0004h
CWG3AS1_AS4E_SIZE                        equ 0001h
CWG3AS1_AS4E_LENGTH                      equ 0001h
CWG3AS1_AS4E_MASK                        equ 0010h
CWG3AS1_AS5E_POSN                        equ 0005h
CWG3AS1_AS5E_POSITION                    equ 0005h
CWG3AS1_AS5E_SIZE                        equ 0001h
CWG3AS1_AS5E_LENGTH                      equ 0001h
CWG3AS1_AS5E_MASK                        equ 0020h
CWG3AS1_AS6E_POSN                        equ 0006h
CWG3AS1_AS6E_POSITION                    equ 0006h
CWG3AS1_AS6E_SIZE                        equ 0001h
CWG3AS1_AS6E_LENGTH                      equ 0001h
CWG3AS1_AS6E_MASK                        equ 0040h
CWG3AS1_AS7E_POSN                        equ 0007h
CWG3AS1_AS7E_POSITION                    equ 0007h
CWG3AS1_AS7E_SIZE                        equ 0001h
CWG3AS1_AS7E_LENGTH                      equ 0001h
CWG3AS1_AS7E_MASK                        equ 0080h

// Register: CWG3STR
#define CWG3STR CWG3STR
CWG3STR                                  equ 03D6h
// bitfield definitions
CWG3STR_STRA_POSN                        equ 0000h
CWG3STR_STRA_POSITION                    equ 0000h
CWG3STR_STRA_SIZE                        equ 0001h
CWG3STR_STRA_LENGTH                      equ 0001h
CWG3STR_STRA_MASK                        equ 0001h
CWG3STR_STRB_POSN                        equ 0001h
CWG3STR_STRB_POSITION                    equ 0001h
CWG3STR_STRB_SIZE                        equ 0001h
CWG3STR_STRB_LENGTH                      equ 0001h
CWG3STR_STRB_MASK                        equ 0002h
CWG3STR_STRC_POSN                        equ 0002h
CWG3STR_STRC_POSITION                    equ 0002h
CWG3STR_STRC_SIZE                        equ 0001h
CWG3STR_STRC_LENGTH                      equ 0001h
CWG3STR_STRC_MASK                        equ 0004h
CWG3STR_STRD_POSN                        equ 0003h
CWG3STR_STRD_POSITION                    equ 0003h
CWG3STR_STRD_SIZE                        equ 0001h
CWG3STR_STRD_LENGTH                      equ 0001h
CWG3STR_STRD_MASK                        equ 0008h
CWG3STR_OVRA_POSN                        equ 0004h
CWG3STR_OVRA_POSITION                    equ 0004h
CWG3STR_OVRA_SIZE                        equ 0001h
CWG3STR_OVRA_LENGTH                      equ 0001h
CWG3STR_OVRA_MASK                        equ 0010h
CWG3STR_OVRB_POSN                        equ 0005h
CWG3STR_OVRB_POSITION                    equ 0005h
CWG3STR_OVRB_SIZE                        equ 0001h
CWG3STR_OVRB_LENGTH                      equ 0001h
CWG3STR_OVRB_MASK                        equ 0020h
CWG3STR_OVRC_POSN                        equ 0006h
CWG3STR_OVRC_POSITION                    equ 0006h
CWG3STR_OVRC_SIZE                        equ 0001h
CWG3STR_OVRC_LENGTH                      equ 0001h
CWG3STR_OVRC_MASK                        equ 0040h
CWG3STR_OVRD_POSN                        equ 0007h
CWG3STR_OVRD_POSITION                    equ 0007h
CWG3STR_OVRD_SIZE                        equ 0001h
CWG3STR_OVRD_LENGTH                      equ 0001h
CWG3STR_OVRD_MASK                        equ 0080h
CWG3STR_CWG3STRA_POSN                    equ 0000h
CWG3STR_CWG3STRA_POSITION                equ 0000h
CWG3STR_CWG3STRA_SIZE                    equ 0001h
CWG3STR_CWG3STRA_LENGTH                  equ 0001h
CWG3STR_CWG3STRA_MASK                    equ 0001h
CWG3STR_CWG3STRB_POSN                    equ 0001h
CWG3STR_CWG3STRB_POSITION                equ 0001h
CWG3STR_CWG3STRB_SIZE                    equ 0001h
CWG3STR_CWG3STRB_LENGTH                  equ 0001h
CWG3STR_CWG3STRB_MASK                    equ 0002h
CWG3STR_CWG3STRC_POSN                    equ 0002h
CWG3STR_CWG3STRC_POSITION                equ 0002h
CWG3STR_CWG3STRC_SIZE                    equ 0001h
CWG3STR_CWG3STRC_LENGTH                  equ 0001h
CWG3STR_CWG3STRC_MASK                    equ 0004h
CWG3STR_CWG3STRD_POSN                    equ 0003h
CWG3STR_CWG3STRD_POSITION                equ 0003h
CWG3STR_CWG3STRD_SIZE                    equ 0001h
CWG3STR_CWG3STRD_LENGTH                  equ 0001h
CWG3STR_CWG3STRD_MASK                    equ 0008h
CWG3STR_CWG3OVRA_POSN                    equ 0004h
CWG3STR_CWG3OVRA_POSITION                equ 0004h
CWG3STR_CWG3OVRA_SIZE                    equ 0001h
CWG3STR_CWG3OVRA_LENGTH                  equ 0001h
CWG3STR_CWG3OVRA_MASK                    equ 0010h
CWG3STR_CWG3OVRB_POSN                    equ 0005h
CWG3STR_CWG3OVRB_POSITION                equ 0005h
CWG3STR_CWG3OVRB_SIZE                    equ 0001h
CWG3STR_CWG3OVRB_LENGTH                  equ 0001h
CWG3STR_CWG3OVRB_MASK                    equ 0020h
CWG3STR_CWG3OVRC_POSN                    equ 0006h
CWG3STR_CWG3OVRC_POSITION                equ 0006h
CWG3STR_CWG3OVRC_SIZE                    equ 0001h
CWG3STR_CWG3OVRC_LENGTH                  equ 0001h
CWG3STR_CWG3OVRC_MASK                    equ 0040h
CWG3STR_CWG3OVRD_POSN                    equ 0007h
CWG3STR_CWG3OVRD_POSITION                equ 0007h
CWG3STR_CWG3OVRD_SIZE                    equ 0001h
CWG3STR_CWG3OVRD_LENGTH                  equ 0001h
CWG3STR_CWG3OVRD_MASK                    equ 0080h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 03D7h
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_RDY_POSN                          equ 0006h
FVRCON_RDY_POSITION                      equ 0006h
FVRCON_RDY_SIZE                          equ 0001h
FVRCON_RDY_LENGTH                        equ 0001h
FVRCON_RDY_MASK                          equ 0040h
FVRCON_EN_POSN                           equ 0007h
FVRCON_EN_POSITION                       equ 0007h
FVRCON_EN_SIZE                           equ 0001h
FVRCON_EN_LENGTH                         equ 0001h
FVRCON_EN_MASK                           equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h

// Register: ADCPCON
#define ADCPCON ADCPCON
ADCPCON                                  equ 03D8h
// bitfield definitions
ADCPCON_CPRDY_POSN                       equ 0000h
ADCPCON_CPRDY_POSITION                   equ 0000h
ADCPCON_CPRDY_SIZE                       equ 0001h
ADCPCON_CPRDY_LENGTH                     equ 0001h
ADCPCON_CPRDY_MASK                       equ 0001h
ADCPCON_ON_POSN                          equ 0007h
ADCPCON_ON_POSITION                      equ 0007h
ADCPCON_ON_SIZE                          equ 0001h
ADCPCON_ON_LENGTH                        equ 0001h
ADCPCON_ON_MASK                          equ 0080h
ADCPCON_ADCPRDY_POSN                     equ 0000h
ADCPCON_ADCPRDY_POSITION                 equ 0000h
ADCPCON_ADCPRDY_SIZE                     equ 0001h
ADCPCON_ADCPRDY_LENGTH                   equ 0001h
ADCPCON_ADCPRDY_MASK                     equ 0001h
ADCPCON_CPON_POSN                        equ 0007h
ADCPCON_CPON_POSITION                    equ 0007h
ADCPCON_CPON_SIZE                        equ 0001h
ADCPCON_CPON_LENGTH                      equ 0001h
ADCPCON_CPON_MASK                        equ 0080h
ADCPCON_ADCPON_POSN                      equ 0007h
ADCPCON_ADCPON_POSITION                  equ 0007h
ADCPCON_ADCPON_SIZE                      equ 0001h
ADCPCON_ADCPON_LENGTH                    equ 0001h
ADCPCON_ADCPON_MASK                      equ 0080h

// Register: ADLTH
#define ADLTH ADLTH
ADLTH                                    equ 03D9h

