GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
// Register: NCO2ACCU
#define NCO2ACCU NCO2ACCU
NCO2ACCU                                 equ 044Ah
// bitfield definitions
NCO2ACCU_ACC_POSN                        equ 0000h
NCO2ACCU_ACC_POSITION                    equ 0000h
NCO2ACCU_ACC_SIZE                        equ 0004h
NCO2ACCU_ACC_LENGTH                      equ 0004h
NCO2ACCU_ACC_MASK                        equ 000Fh
NCO2ACCU_NCO2ACC16_POSN                  equ 0000h
NCO2ACCU_NCO2ACC16_POSITION              equ 0000h
NCO2ACCU_NCO2ACC16_SIZE                  equ 0001h
NCO2ACCU_NCO2ACC16_LENGTH                equ 0001h
NCO2ACCU_NCO2ACC16_MASK                  equ 0001h
NCO2ACCU_NCO2ACC17_POSN                  equ 0001h
NCO2ACCU_NCO2ACC17_POSITION              equ 0001h
NCO2ACCU_NCO2ACC17_SIZE                  equ 0001h
NCO2ACCU_NCO2ACC17_LENGTH                equ 0001h
NCO2ACCU_NCO2ACC17_MASK                  equ 0002h
NCO2ACCU_NCO2ACC18_POSN                  equ 0002h
NCO2ACCU_NCO2ACC18_POSITION              equ 0002h
NCO2ACCU_NCO2ACC18_SIZE                  equ 0001h
NCO2ACCU_NCO2ACC18_LENGTH                equ 0001h
NCO2ACCU_NCO2ACC18_MASK                  equ 0004h
NCO2ACCU_NCO2ACC19_POSN                  equ 0003h
NCO2ACCU_NCO2ACC19_POSITION              equ 0003h
NCO2ACCU_NCO2ACC19_SIZE                  equ 0001h
NCO2ACCU_NCO2ACC19_LENGTH                equ 0001h
NCO2ACCU_NCO2ACC19_MASK                  equ 0008h
NCO2ACCU_ACC16_POSN                      equ 0000h
NCO2ACCU_ACC16_POSITION                  equ 0000h
NCO2ACCU_ACC16_SIZE                      equ 0001h
NCO2ACCU_ACC16_LENGTH                    equ 0001h
NCO2ACCU_ACC16_MASK                      equ 0001h
NCO2ACCU_ACC17_POSN                      equ 0001h
NCO2ACCU_ACC17_POSITION                  equ 0001h
NCO2ACCU_ACC17_SIZE                      equ 0001h
NCO2ACCU_ACC17_LENGTH                    equ 0001h
NCO2ACCU_ACC17_MASK                      equ 0002h
NCO2ACCU_ACC18_POSN                      equ 0002h
NCO2ACCU_ACC18_POSITION                  equ 0002h
NCO2ACCU_ACC18_SIZE                      equ 0001h
NCO2ACCU_ACC18_LENGTH                    equ 0001h
NCO2ACCU_ACC18_MASK                      equ 0004h
NCO2ACCU_ACC19_POSN                      equ 0003h
NCO2ACCU_ACC19_POSITION                  equ 0003h
NCO2ACCU_ACC19_SIZE                      equ 0001h
NCO2ACCU_ACC19_LENGTH                    equ 0001h
NCO2ACCU_ACC19_MASK                      equ 0008h
NCO2ACCU_NCO2ACC_POSN                    equ 0000h
NCO2ACCU_NCO2ACC_POSITION                equ 0000h
NCO2ACCU_NCO2ACC_SIZE                    equ 0004h
NCO2ACCU_NCO2ACC_LENGTH                  equ 0004h
NCO2ACCU_NCO2ACC_MASK                    equ 000Fh

// Register: NCO2INC
#define NCO2INC NCO2INC
NCO2INC                                  equ 044Bh

// Register: NCO2INCL
#define NCO2INCL NCO2INCL
NCO2INCL                                 equ 044Bh
// bitfield definitions
NCO2INCL_INC_POSN                        equ 0000h
NCO2INCL_INC_POSITION                    equ 0000h
NCO2INCL_INC_SIZE                        equ 0008h
NCO2INCL_INC_LENGTH                      equ 0008h
NCO2INCL_INC_MASK                        equ 00FFh
NCO2INCL_NCO2INC0_POSN                   equ 0000h
NCO2INCL_NCO2INC0_POSITION               equ 0000h
NCO2INCL_NCO2INC0_SIZE                   equ 0001h
NCO2INCL_NCO2INC0_LENGTH                 equ 0001h
NCO2INCL_NCO2INC0_MASK                   equ 0001h
NCO2INCL_NCO2INC1_POSN                   equ 0001h
NCO2INCL_NCO2INC1_POSITION               equ 0001h
NCO2INCL_NCO2INC1_SIZE                   equ 0001h
NCO2INCL_NCO2INC1_LENGTH                 equ 0001h
NCO2INCL_NCO2INC1_MASK                   equ 0002h
NCO2INCL_NCO2INC2_POSN                   equ 0002h
NCO2INCL_NCO2INC2_POSITION               equ 0002h
NCO2INCL_NCO2INC2_SIZE                   equ 0001h
NCO2INCL_NCO2INC2_LENGTH                 equ 0001h
NCO2INCL_NCO2INC2_MASK                   equ 0004h
NCO2INCL_NCO2INC3_POSN                   equ 0003h
NCO2INCL_NCO2INC3_POSITION               equ 0003h
NCO2INCL_NCO2INC3_SIZE                   equ 0001h
NCO2INCL_NCO2INC3_LENGTH                 equ 0001h
NCO2INCL_NCO2INC3_MASK                   equ 0008h
NCO2INCL_NCO2INC4_POSN                   equ 0004h
NCO2INCL_NCO2INC4_POSITION               equ 0004h
NCO2INCL_NCO2INC4_SIZE                   equ 0001h
NCO2INCL_NCO2INC4_LENGTH                 equ 0001h
NCO2INCL_NCO2INC4_MASK                   equ 0010h
NCO2INCL_NCO2INC5_POSN                   equ 0005h
NCO2INCL_NCO2INC5_POSITION               equ 0005h
NCO2INCL_NCO2INC5_SIZE                   equ 0001h
NCO2INCL_NCO2INC5_LENGTH                 equ 0001h
NCO2INCL_NCO2INC5_MASK                   equ 0020h
NCO2INCL_NCO2INC6_POSN                   equ 0006h
NCO2INCL_NCO2INC6_POSITION               equ 0006h
NCO2INCL_NCO2INC6_SIZE                   equ 0001h
NCO2INCL_NCO2INC6_LENGTH                 equ 0001h
NCO2INCL_NCO2INC6_MASK                   equ 0040h
NCO2INCL_NCO2INC7_POSN                   equ 0007h
NCO2INCL_NCO2INC7_POSITION               equ 0007h
NCO2INCL_NCO2INC7_SIZE                   equ 0001h
NCO2INCL_NCO2INC7_LENGTH                 equ 0001h
NCO2INCL_NCO2INC7_MASK                   equ 0080h
NCO2INCL_INC0_POSN                       equ 0000h
NCO2INCL_INC0_POSITION                   equ 0000h
NCO2INCL_INC0_SIZE                       equ 0001h
NCO2INCL_INC0_LENGTH                     equ 0001h
NCO2INCL_INC0_MASK                       equ 0001h
NCO2INCL_INC1_POSN                       equ 0001h
NCO2INCL_INC1_POSITION                   equ 0001h
NCO2INCL_INC1_SIZE                       equ 0001h
NCO2INCL_INC1_LENGTH                     equ 0001h
NCO2INCL_INC1_MASK                       equ 0002h
NCO2INCL_INC2_POSN                       equ 0002h
NCO2INCL_INC2_POSITION                   equ 0002h
NCO2INCL_INC2_SIZE                       equ 0001h
NCO2INCL_INC2_LENGTH                     equ 0001h
NCO2INCL_INC2_MASK                       equ 0004h
NCO2INCL_INC3_POSN                       equ 0003h
NCO2INCL_INC3_POSITION                   equ 0003h
NCO2INCL_INC3_SIZE                       equ 0001h
NCO2INCL_INC3_LENGTH                     equ 0001h
NCO2INCL_INC3_MASK                       equ 0008h
NCO2INCL_INC4_POSN                       equ 0004h
NCO2INCL_INC4_POSITION                   equ 0004h
NCO2INCL_INC4_SIZE                       equ 0001h
NCO2INCL_INC4_LENGTH                     equ 0001h
NCO2INCL_INC4_MASK                       equ 0010h
NCO2INCL_INC5_POSN                       equ 0005h
NCO2INCL_INC5_POSITION                   equ 0005h
NCO2INCL_INC5_SIZE                       equ 0001h
NCO2INCL_INC5_LENGTH                     equ 0001h
NCO2INCL_INC5_MASK                       equ 0020h
NCO2INCL_INC6_POSN                       equ 0006h
NCO2INCL_INC6_POSITION                   equ 0006h
NCO2INCL_INC6_SIZE                       equ 0001h
NCO2INCL_INC6_LENGTH                     equ 0001h
NCO2INCL_INC6_MASK                       equ 0040h
NCO2INCL_INC7_POSN                       equ 0007h
NCO2INCL_INC7_POSITION                   equ 0007h
NCO2INCL_INC7_SIZE                       equ 0001h
NCO2INCL_INC7_LENGTH                     equ 0001h
NCO2INCL_INC7_MASK                       equ 0080h
NCO2INCL_NCO2INC_POSN                    equ 0000h
NCO2INCL_NCO2INC_POSITION                equ 0000h
NCO2INCL_NCO2INC_SIZE                    equ 0008h
NCO2INCL_NCO2INC_LENGTH                  equ 0008h
NCO2INCL_NCO2INC_MASK                    equ 00FFh

// Register: NCO2INCH
#define NCO2INCH NCO2INCH
NCO2INCH                                 equ 044Ch
// bitfield definitions
NCO2INCH_INC_POSN                        equ 0000h
NCO2INCH_INC_POSITION                    equ 0000h
NCO2INCH_INC_SIZE                        equ 0008h
NCO2INCH_INC_LENGTH                      equ 0008h
NCO2INCH_INC_MASK                        equ 00FFh
NCO2INCH_NCO2INC8_POSN                   equ 0000h
NCO2INCH_NCO2INC8_POSITION               equ 0000h
NCO2INCH_NCO2INC8_SIZE                   equ 0001h
NCO2INCH_NCO2INC8_LENGTH                 equ 0001h
NCO2INCH_NCO2INC8_MASK                   equ 0001h
NCO2INCH_NCO2INC9_POSN                   equ 0001h
NCO2INCH_NCO2INC9_POSITION               equ 0001h
NCO2INCH_NCO2INC9_SIZE                   equ 0001h
NCO2INCH_NCO2INC9_LENGTH                 equ 0001h
NCO2INCH_NCO2INC9_MASK                   equ 0002h
NCO2INCH_NCO2INC10_POSN                  equ 0002h
NCO2INCH_NCO2INC10_POSITION              equ 0002h
NCO2INCH_NCO2INC10_SIZE                  equ 0001h
NCO2INCH_NCO2INC10_LENGTH                equ 0001h
NCO2INCH_NCO2INC10_MASK                  equ 0004h
NCO2INCH_NCO2INC11_POSN                  equ 0003h
NCO2INCH_NCO2INC11_POSITION              equ 0003h
NCO2INCH_NCO2INC11_SIZE                  equ 0001h
NCO2INCH_NCO2INC11_LENGTH                equ 0001h
NCO2INCH_NCO2INC11_MASK                  equ 0008h
NCO2INCH_NCO2INC12_POSN                  equ 0004h
NCO2INCH_NCO2INC12_POSITION              equ 0004h
NCO2INCH_NCO2INC12_SIZE                  equ 0001h
NCO2INCH_NCO2INC12_LENGTH                equ 0001h
NCO2INCH_NCO2INC12_MASK                  equ 0010h
NCO2INCH_NCO2INC13_POSN                  equ 0005h
NCO2INCH_NCO2INC13_POSITION              equ 0005h
NCO2INCH_NCO2INC13_SIZE                  equ 0001h
NCO2INCH_NCO2INC13_LENGTH                equ 0001h
NCO2INCH_NCO2INC13_MASK                  equ 0020h
NCO2INCH_NCO2INC14_POSN                  equ 0006h
NCO2INCH_NCO2INC14_POSITION              equ 0006h
NCO2INCH_NCO2INC14_SIZE                  equ 0001h
NCO2INCH_NCO2INC14_LENGTH                equ 0001h
NCO2INCH_NCO2INC14_MASK                  equ 0040h
NCO2INCH_NCO2INC15_POSN                  equ 0007h
NCO2INCH_NCO2INC15_POSITION              equ 0007h
NCO2INCH_NCO2INC15_SIZE                  equ 0001h
NCO2INCH_NCO2INC15_LENGTH                equ 0001h
NCO2INCH_NCO2INC15_MASK                  equ 0080h
NCO2INCH_INC8_POSN                       equ 0000h
NCO2INCH_INC8_POSITION                   equ 0000h
NCO2INCH_INC8_SIZE                       equ 0001h
NCO2INCH_INC8_LENGTH                     equ 0001h
NCO2INCH_INC8_MASK                       equ 0001h
NCO2INCH_INC9_POSN                       equ 0001h
NCO2INCH_INC9_POSITION                   equ 0001h
NCO2INCH_INC9_SIZE                       equ 0001h
NCO2INCH_INC9_LENGTH                     equ 0001h
NCO2INCH_INC9_MASK                       equ 0002h
NCO2INCH_INC10_POSN                      equ 0002h
NCO2INCH_INC10_POSITION                  equ 0002h
NCO2INCH_INC10_SIZE                      equ 0001h
NCO2INCH_INC10_LENGTH                    equ 0001h
NCO2INCH_INC10_MASK                      equ 0004h
NCO2INCH_INC11_POSN                      equ 0003h
NCO2INCH_INC11_POSITION                  equ 0003h
NCO2INCH_INC11_SIZE                      equ 0001h
NCO2INCH_INC11_LENGTH                    equ 0001h
NCO2INCH_INC11_MASK                      equ 0008h
NCO2INCH_INC12_POSN                      equ 0004h
NCO2INCH_INC12_POSITION                  equ 0004h
NCO2INCH_INC12_SIZE                      equ 0001h
NCO2INCH_INC12_LENGTH                    equ 0001h
NCO2INCH_INC12_MASK                      equ 0010h
NCO2INCH_INC13_POSN                      equ 0005h
NCO2INCH_INC13_POSITION                  equ 0005h
NCO2INCH_INC13_SIZE                      equ 0001h
NCO2INCH_INC13_LENGTH                    equ 0001h
NCO2INCH_INC13_MASK                      equ 0020h
NCO2INCH_INC14_POSN                      equ 0006h
NCO2INCH_INC14_POSITION                  equ 0006h
NCO2INCH_INC14_SIZE                      equ 0001h
NCO2INCH_INC14_LENGTH                    equ 0001h
NCO2INCH_INC14_MASK                      equ 0040h
NCO2INCH_INC15_POSN                      equ 0007h
NCO2INCH_INC15_POSITION                  equ 0007h
NCO2INCH_INC15_SIZE                      equ 0001h
NCO2INCH_INC15_LENGTH                    equ 0001h
NCO2INCH_INC15_MASK                      equ 0080h
NCO2INCH_NCO2INC_POSN                    equ 0000h
NCO2INCH_NCO2INC_POSITION                equ 0000h
NCO2INCH_NCO2INC_SIZE                    equ 0008h
NCO2INCH_NCO2INC_LENGTH                  equ 0008h
NCO2INCH_NCO2INC_MASK                    equ 00FFh

