GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
#define CPW22                            BANKMASK(SMT1CPWU), 6, b
#define CPW23                            BANKMASK(SMT1CPWU), 7, b
#define CPW3                             BANKMASK(SMT1CPWL), 3, b
#define CPW4                             BANKMASK(SMT1CPWL), 4, b
#define CPW5                             BANKMASK(SMT1CPWL), 5, b
#define CPW6                             BANKMASK(SMT1CPWL), 6, b
#define CPW7                             BANKMASK(SMT1CPWL), 7, b
#define CPW8                             BANKMASK(SMT1CPWH), 0, b
#define CPW9                             BANKMASK(SMT1CPWH), 1, b
#define CPWUP                            BANKMASK(SMT1STAT), 6, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE15), 2, a
#define CRCIF                            BANKMASK(PIR15), 2, a
#define CRCIP                            BANKMASK(IPR15), 2, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSD                              BANKMASK(I2C1CON1), 0, b
#define CSEL0                            BANKMASK(SMT1CLK), 0, b
#define CSEL1                            BANKMASK(SMT1CLK), 1, b
#define CSEL2                            BANKMASK(SMT1CLK), 2, b
#define CSEN                             BANKMASK(ADCON0), 5, b
#define CSTR                             BANKMASK(I2C1CON0), 4, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, a
#define CSWIF                            BANKMASK(PIR0), 3, a
#define CSWIP                            BANKMASK(IPR0), 3, b
#define CTX0                             BANKMASK(ADCTX), 0, b
#define CTX1                             BANKMASK(ADCTX), 1, b
#define CTXSW                            BANKMASK(ADCTX), 7, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE6), 2, a
#define CWG1IF                           BANKMASK(PIR6), 2, a
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1IP                           BANKMASK(IPR6), 2, b
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0, b
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1, b
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2, b
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD4), 4, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1REN                          BANKMASK(CWG1AS0), 6, b
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWG2CS                           BANKMASK(CWG2CLK), 0, b
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0, b
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1, b
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2, b
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3, b
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4, b
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5, b
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0, b
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1, b
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2, b
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3, b
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4, b
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5, b
#define CWG2EN                           BANKMASK(CWG2CON0), 7, b
#define CWG2IE                           BANKMASK(PIE10), 2, a
#define CWG2IF                           BANKMASK(PIR10), 2, a
#define CWG2IN                           BANKMASK(CWG2CON1), 5, b
#define CWG2INPPS0                       BANKMASK(CWG2PPS), 0, b
#define CWG2INPPS1                       BANKMASK(CWG2PPS), 1, b
#define CWG2INPPS2                       BANKMASK(CWG2PPS), 2, b
#define CWG2INPPS3                       BANKMASK(CWG2PPS), 3, b
#define CWG2INPPS4                       BANKMASK(CWG2PPS), 4, b
#define CWG2IP                           BANKMASK(IPR10), 2, b
#define CWG2ISM0                         BANKMASK(CWG2ISM), 0, b
#define CWG2ISM1                         BANKMASK(CWG2ISM), 1, b
#define CWG2ISM2                         BANKMASK(CWG2ISM), 2, b
#define CWG2ISM3                         BANKMASK(CWG2ISM), 3, b
#define CWG2LD                           BANKMASK(CWG2CON0), 6, b
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2, b
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3, b
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5, b
#define CWG2MD                           BANKMASK(PMD4), 5, b
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0, b
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1, b
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2, b
#define CWG2OVRA                         BANKMASK(CWG2STR), 4, b
#define CWG2OVRB                         BANKMASK(CWG2STR), 5, b
#define CWG2OVRC                         BANKMASK(CWG2STR), 6, b
#define CWG2OVRD                         BANKMASK(CWG2STR), 7, b
#define CWG2POLA                         BANKMASK(CWG2CON1), 0, b
#define CWG2POLB                         BANKMASK(CWG2CON1), 1, b
#define CWG2POLC                         BANKMASK(CWG2CON1), 2, b
#define CWG2POLD                         BANKMASK(CWG2CON1), 3, b
#define CWG2REN                          BANKMASK(CWG2AS0), 6, b
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7, b
#define CWG2STRA                         BANKMASK(CWG2STR), 0, b
#define CWG2STRB                         BANKMASK(CWG2STR), 1, b
#define CWG2STRC                         BANKMASK(CWG2STR), 2, b
#define CWG2STRD                         BANKMASK(CWG2STR), 3, b
#define CWG3CS                           BANKMASK(CWG3CLK), 0, b
#define CWG3DBF0                         BANKMASK(CWG3DBF), 0, b
#define CWG3DBF1                         BANKMASK(CWG3DBF), 1, b
#define CWG3DBF2                         BANKMASK(CWG3DBF), 2, b
#define CWG3DBF3                         BANKMASK(CWG3DBF), 3, b
#define CWG3DBF4                         BANKMASK(CWG3DBF), 4, b
#define CWG3DBF5                         BANKMASK(CWG3DBF), 5, b
#define CWG3DBR0                         BANKMASK(CWG3DBR), 0, b
#define CWG3DBR1                         BANKMASK(CWG3DBR), 1, b
#define CWG3DBR2                         BANKMASK(CWG3DBR), 2, b
#define CWG3DBR3                         BANKMASK(CWG3DBR), 3, b
#define CWG3DBR4                         BANKMASK(CWG3DBR), 4, b
#define CWG3DBR5                         BANKMASK(CWG3DBR), 5, b
#define CWG3EN                           BANKMASK(CWG3CON0), 7, b
#define CWG3IE                           BANKMASK(PIE11), 2, a
#define CWG3IF                           BANKMASK(PIR11), 2, a
#define CWG3IN                           BANKMASK(CWG3CON1), 5, b
#define CWG3INPPS0                       BANKMASK(CWG3PPS), 0, b
#define CWG3INPPS1                       BANKMASK(CWG3PPS), 1, b
#define CWG3INPPS2                       BANKMASK(CWG3PPS), 2, b
#define CWG3INPPS3                       BANKMASK(CWG3PPS), 3, b
#define CWG3INPPS4                       BANKMASK(CWG3PPS), 4, b
#define CWG3IP                           BANKMASK(IPR11), 2, b
#define CWG3ISM0                         BANKMASK(CWG3ISM), 0, b
#define CWG3ISM1                         BANKMASK(CWG3ISM), 1, b
#define CWG3ISM2                         BANKMASK(CWG3ISM), 2, b
#define CWG3ISM3                         BANKMASK(CWG3ISM), 3, b
#define CWG3LD                           BANKMASK(CWG3CON0), 6, b
#define CWG3LSAC0                        BANKMASK(CWG3AS0), 2, b
#define CWG3LSAC1                        BANKMASK(CWG3AS0), 3, b
#define CWG3LSBD0                        BANKMASK(CWG3AS0), 4, b
#define CWG3LSBD1                        BANKMASK(CWG3AS0), 5, b
#define CWG3MD                           BANKMASK(PMD4), 6, b
#define CWG3MODE0                        BANKMASK(CWG3CON0), 0, b
#define CWG3MODE1                        BANKMASK(CWG3CON0), 1, b
#define CWG3MODE2                        BANKMASK(CWG3CON0), 2, b
#define CWG3OVRA                         BANKMASK(CWG3STR), 4, b
#define CWG3OVRB                         BANKMASK(CWG3STR), 5, b
#define CWG3OVRC                         BANKMASK(CWG3STR), 6, b
#define CWG3OVRD                         BANKMASK(CWG3STR), 7, b
#define CWG3POLA                         BANKMASK(CWG3CON1), 0, b
#define CWG3POLB                         BANKMASK(CWG3CON1), 1, b
#define CWG3POLC                         BANKMASK(CWG3CON1), 2, b
#define CWG3POLD                         BANKMASK(CWG3CON1), 3, b
#define CWG3REN                          BANKMASK(CWG3AS0), 6, b
#define CWG3SHUTDOWN                     BANKMASK(CWG3AS0), 7, b
#define CWG3STRA                         BANKMASK(CWG3STR), 0, b
#define CWG3STRB                         BANKMASK(CWG3STR), 1, b
#define CWG3STRC                         BANKMASK(CWG3STR), 2, b
#define CWG3STRD                         BANKMASK(CWG3STR), 3, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D1S6                             BANKMASK(CLCnSEL0), 6, b
#define D1S7                             BANKMASK(CLCnSEL0), 7, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D2S6                             BANKMASK(CLCnSEL1), 6, b
#define D2S7                             BANKMASK(CLCnSEL1), 7, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D3S6                             BANKMASK(CLCnSEL2), 6, b
#define D3S7                             BANKMASK(CLCnSEL2), 7, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define D4S6                             BANKMASK(CLCnSEL3), 6, b
#define D4S7                             BANKMASK(CLCnSEL3), 7, b
#define DAC1EN                           BANKMASK(DAC1CON), 7, b
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
#define DAC1R1                           BANKMASK(DAC1DATL), 1, b
#define DAC1R2                           BANKMASK(DAC1DATL), 2, b
#define DAC1R3                           BANKMASK(DAC1DATL), 3, b
#define DAC1R4                           BANKMASK(DAC1DATL), 4, b
#define DAC1R5                           BANKMASK(DAC1DATL), 5, b
#define DAC1R6                           BANKMASK(DAC1DATL), 6, b
#define DAC1R7                           BANKMASK(DAC1DATL), 7, b
#define DACMD                            BANKMASK(PMD3), 6, b
#define DATA                             BANKMASK(I2C1STAT0), 3, b
#define DATA0                            BANKMASK(CRCDATAL), 0, b
#define DATA1                            BANKMASK(CRCDATAL), 1, b
#define DATA10                           BANKMASK(CRCDATAH), 2, b
#define DATA11                           BANKMASK(CRCDATAH), 3, b
#define DATA12                           BANKMASK(CRCDATAH), 4, b
#define DATA13                           BANKMASK(CRCDATAH), 5, b
#define DATA14                           BANKMASK(CRCDATAH), 6, b
#define DATA15                           BANKMASK(CRCDATAH), 7, b
#define DATA16                           BANKMASK(CRCDATAU), 0, b
#define DATA17                           BANKMASK(CRCDATAU), 1, b
#define DATA18                           BANKMASK(CRCDATAU), 2, b
#define DATA19                           BANKMASK(CRCDATAU), 3, b
#define DATA2                            BANKMASK(CRCDATAL), 2, b
#define DATA20                           BANKMASK(CRCDATAU), 4, b
#define DATA21                           BANKMASK(CRCDATAU), 5, b
#define DATA22                           BANKMASK(CRCDATAU), 6, b
#define DATA23                           BANKMASK(CRCDATAU), 7, b
#define DATA24                           BANKMASK(CRCDATAT), 0, b
#define DATA25                           BANKMASK(CRCDATAT), 1, b
#define DATA26                           BANKMASK(CRCDATAT), 2, b
#define DATA27                           BANKMASK(CRCDATAT), 3, b
#define DATA28                           BANKMASK(CRCDATAT), 4, b
#define DATA29                           BANKMASK(CRCDATAT), 5, b
#define DATA3                            BANKMASK(CRCDATAL), 3, b
#define DATA30                           BANKMASK(CRCDATAT), 6, b
#define DATA31                           BANKMASK(CRCDATAT), 7, b
#define DATA4                            BANKMASK(CRCDATAL), 4, b
#define DATA5                            BANKMASK(CRCDATAL), 5, b
#define DATA6                            BANKMASK(CRCDATAL), 6, b
#define DATA7                            BANKMASK(CRCDATAL), 7, b
#define DATA8                            BANKMASK(CRCDATAH), 0, b
#define DATA9                            BANKMASK(CRCDATAH), 1, b
#define DBIT0ERR                         BANKMASK(C1BDIAG1T), 0, b
#define DBIT1ERR                         BANKMASK(C1BDIAG1T), 1, b
#define DC0                              BANKMASK(CLKRCON), 3, b
#define DC1                              BANKMASK(CLKRCON), 4, b
#define DCNT0                            BANKMASK(DMAnDCNTL), 0, b
#define DCNT1                            BANKMASK(DMAnDCNTL), 1, b
#define DCNT10                           BANKMASK(DMAnDCNTH), 2, b
#define DCNT11                           BANKMASK(DMAnDCNTH), 3, b
#define DCNT2                            BANKMASK(DMAnDCNTL), 2, b
#define DCNT3                            BANKMASK(DMAnDCNTL), 3, b
#define DCNT4                            BANKMASK(DMAnDCNTL), 4, b
#define DCNT5                            BANKMASK(DMAnDCNTL), 5, b
#define DCNT6                            BANKMASK(DMAnDCNTL), 6, b
#define DCNT7                            BANKMASK(DMAnDCNTL), 7, b
#define DCNT8                            BANKMASK(DMAnDCNTH), 0, b
#define DCNT9                            BANKMASK(DMAnDCNTH), 1, b
#define DCRCERR                          BANKMASK(C1BDIAG1T), 5, b
#define DFORMERR                         BANKMASK(C1BDIAG1T), 3, b
#define DGO                              BANKMASK(DMAnCON0), 5, b
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLCMM                            BANKMASK(C1BDIAG1T), 7, b
#define DLEN0                            BANKMASK(CRCCON2), 0, b
#define DLEN1                            BANKMASK(CRCCON2), 1, b
#define DLEN2                            BANKMASK(CRCCON2), 2, b
#define DLEN3                            BANKMASK(CRCCON2), 3, b
#define DLEN4                            BANKMASK(CRCCON2), 4, b
#define DMA1AIE                          BANKMASK(PIE2), 7, a
#define DMA1AIF                          BANKMASK(PIR2), 7, a
#define DMA1AIP                          BANKMASK(IPR2), 7, b
#define DMA1DCNTIE                       BANKMASK(PIE2), 5, a
#define DMA1DCNTIF                       BANKMASK(PIR2), 5, a
#define DMA1DCNTIP                       BANKMASK(IPR2), 5, b
#define DMA1MD                           BANKMASK(PMD8), 0, b
#define DMA1ORIE                         BANKMASK(PIE2), 6, a
#define DMA1ORIF                         BANKMASK(PIR2), 6, a
#define DMA1ORIP                         BANKMASK(IPR2), 6, b
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNTIE                       BANKMASK(PIE2), 4, a
#define DMA1SCNTIF                       BANKMASK(PIR2), 4, a
#define DMA1SCNTIP                       BANKMASK(IPR2), 4, b
#define DMA2AIE                          BANKMASK(PIE6), 7, a
#define DMA2AIF                          BANKMASK(PIR6), 7, a
#define DMA2AIP                          BANKMASK(IPR6), 7, b
#define DMA2DCNTIE                       BANKMASK(PIE6), 5, a
#define DMA2DCNTIF                       BANKMASK(PIR6), 5, a
#define DMA2DCNTIP                       BANKMASK(IPR6), 5, b
#define DMA2MD                           BANKMASK(PMD8), 1, b
#define DMA2ORIE                         BANKMASK(PIE6), 6, a
#define DMA2ORIF                         BANKMASK(PIR6), 6, a
#define DMA2ORIP                         BANKMASK(IPR6), 6, b
#define DMA2PR0                          BANKMASK(DMA2PR), 0, b
#define DMA2PR1                          BANKMASK(DMA2PR), 1, b
#define DMA2PR2                          BANKMASK(DMA2PR), 2, b
#define DMA2SCNTIE                       BANKMASK(PIE6), 4, a
#define DMA2SCNTIF                       BANKMASK(PIR6), 4, a
#define DMA2SCNTIP                       BANKMASK(IPR6), 4, b
#define DMA3AIE                          BANKMASK(PIE10), 7, a
#define DMA3AIF                          BANKMASK(PIR10), 7, a
#define DMA3AIP                          BANKMASK(IPR10), 7, b
#define DMA3DCNTIE                       BANKMASK(PIE10), 5, a
#define DMA3DCNTIF                       BANKMASK(PIR10), 5, a
#define DMA3DCNTIP                       BANKMASK(IPR10), 5, b
#define DMA3MD                           BANKMASK(PMD8), 2, b
#define DMA3ORIE                         BANKMASK(PIE10), 6, a
#define DMA3ORIF                         BANKMASK(PIR10), 6, a
#define DMA3ORIP                         BANKMASK(IPR10), 6, b
#define DMA3PR0                          BANKMASK(DMA3PR), 0, b
#define DMA3PR1                          BANKMASK(DMA3PR), 1, b
#define DMA3PR2                          BANKMASK(DMA3PR), 2, b
#define DMA3SCNTIE                       BANKMASK(PIE10), 4, a
#define DMA3SCNTIF                       BANKMASK(PIR10), 4, a
#define DMA3SCNTIP                       BANKMASK(IPR10), 4, b
#define DMA4AIE                          BANKMASK(PIE11), 7, a
#define DMA4AIF                          BANKMASK(PIR11), 7, a
#define DMA4AIP                          BANKMASK(IPR11), 7, b
#define DMA4DCNTIE                       BANKMASK(PIE11), 5, a
#define DMA4DCNTIF                       BANKMASK(PIR11), 5, a
#define DMA4DCNTIP                       BANKMASK(IPR11), 5, b
#define DMA4MD                           BANKMASK(PMD8), 3, b
#define DMA4ORIE                         BANKMASK(PIE11), 6, a
#define DMA4ORIF                         BANKMASK(PIR11), 6, a
#define DMA4ORIP                         BANKMASK(IPR11), 6, b
#define DMA4PR0                          BANKMASK(DMA4PR), 0, b
#define DMA4PR1                          BANKMASK(DMA4PR), 1, b
#define DMA4PR2                          BANKMASK(DMA4PR), 2, b
#define DMA4SCNTIE                       BANKMASK(PIE11), 4, a
#define DMA4SCNTIF                       BANKMASK(PIR11), 4, a
#define DMA4SCNTIP                       BANKMASK(IPR11), 4, b
#define DMA5AIE                          BANKMASK(PIE12), 7, a
#define DMA5AIF                          BANKMASK(PIR12), 7, a
#define DMA5AIP                          BANKMASK(IPR12), 7, b
#define DMA5DCNTIE                       BANKMASK(PIE12), 5, a
#define DMA5DCNTIF                       BANKMASK(PIR12), 5, a
#define DMA5DCNTIP                       BANKMASK(IPR12), 5, b
#define DMA5MD                           BANKMASK(PMD8), 4, b
#define DMA5ORIE                         BANKMASK(PIE12), 6, a
#define DMA5ORIF                         BANKMASK(PIR12), 6, a
#define DMA5ORIP                         BANKMASK(IPR12), 6, b
#define DMA5PR0                          BANKMASK(DMA5PR), 0, b
#define DMA5PR1                          BANKMASK(DMA5PR), 1, b
#define DMA5PR2                          BANKMASK(DMA5PR), 2, b
#define DMA5SCNTIE                       BANKMASK(PIE12), 4, a
#define DMA5SCNTIF                       BANKMASK(PIR12), 4, a
#define DMA5SCNTIP                       BANKMASK(IPR12), 4, b
#define DMA6AIE                          BANKMASK(PIE13), 7, a
