GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE6), 3, a
#define NCO1IF                           BANKMASK(PIR6), 3, a
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, b
#define NCO1MD                           BANKMASK(PMD4), 0, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NCO2ACC0                         BANKMASK(NCO2ACCL), 0, b
#define NCO2ACC1                         BANKMASK(NCO2ACCL), 1, b
#define NCO2ACC10                        BANKMASK(NCO2ACCH), 2, b
#define NCO2ACC11                        BANKMASK(NCO2ACCH), 3, b
#define NCO2ACC12                        BANKMASK(NCO2ACCH), 4, b
#define NCO2ACC13                        BANKMASK(NCO2ACCH), 5, b
#define NCO2ACC14                        BANKMASK(NCO2ACCH), 6, b
#define NCO2ACC15                        BANKMASK(NCO2ACCH), 7, b
#define NCO2ACC16                        BANKMASK(NCO2ACCU), 0, b
#define NCO2ACC17                        BANKMASK(NCO2ACCU), 1, b
#define NCO2ACC18                        BANKMASK(NCO2ACCU), 2, b
#define NCO2ACC19                        BANKMASK(NCO2ACCU), 3, b
#define NCO2ACC2                         BANKMASK(NCO2ACCL), 2, b
#define NCO2ACC3                         BANKMASK(NCO2ACCL), 3, b
#define NCO2ACC4                         BANKMASK(NCO2ACCL), 4, b
#define NCO2ACC5                         BANKMASK(NCO2ACCL), 5, b
#define NCO2ACC6                         BANKMASK(NCO2ACCL), 6, b
#define NCO2ACC7                         BANKMASK(NCO2ACCL), 7, b
#define NCO2ACC8                         BANKMASK(NCO2ACCH), 0, b
#define NCO2ACC9                         BANKMASK(NCO2ACCH), 1, b
#define NCO2CKS0                         BANKMASK(NCO2CLK), 0, b
#define NCO2CKS1                         BANKMASK(NCO2CLK), 1, b
#define NCO2CKS2                         BANKMASK(NCO2CLK), 2, b
#define NCO2CKS3                         BANKMASK(NCO2CLK), 3, b
#define NCO2EN                           BANKMASK(NCO2CON), 7, b
#define NCO2IE                           BANKMASK(PIE10), 3, a
#define NCO2IF                           BANKMASK(PIR10), 3, a
#define NCO2INC0                         BANKMASK(NCO2INCL), 0, b
#define NCO2INC1                         BANKMASK(NCO2INCL), 1, b
#define NCO2INC10                        BANKMASK(NCO2INCH), 2, b
#define NCO2INC11                        BANKMASK(NCO2INCH), 3, b
#define NCO2INC12                        BANKMASK(NCO2INCH), 4, b
#define NCO2INC13                        BANKMASK(NCO2INCH), 5, b
#define NCO2INC14                        BANKMASK(NCO2INCH), 6, b
#define NCO2INC15                        BANKMASK(NCO2INCH), 7, b
#define NCO2INC16                        BANKMASK(NCO2INCU), 0, b
#define NCO2INC17                        BANKMASK(NCO2INCU), 1, b
#define NCO2INC18                        BANKMASK(NCO2INCU), 2, b
#define NCO2INC19                        BANKMASK(NCO2INCU), 3, b
#define NCO2INC2                         BANKMASK(NCO2INCL), 2, b
#define NCO2INC3                         BANKMASK(NCO2INCL), 3, b
#define NCO2INC4                         BANKMASK(NCO2INCL), 4, b
#define NCO2INC5                         BANKMASK(NCO2INCL), 5, b
#define NCO2INC6                         BANKMASK(NCO2INCL), 6, b
#define NCO2INC7                         BANKMASK(NCO2INCL), 7, b
#define NCO2INC8                         BANKMASK(NCO2INCH), 0, b
#define NCO2INC9                         BANKMASK(NCO2INCH), 1, b
#define NCO2IP                           BANKMASK(IPR10), 3, b
#define NCO2MD                           BANKMASK(PMD4), 1, b
#define NCO2OUT                          BANKMASK(NCO2CON), 5, b
#define NCO2PFM                          BANKMASK(NCO2CON), 0, b
#define NCO2POL                          BANKMASK(NCO2CON), 4, b
#define NCO2PWS0                         BANKMASK(NCO2CLK), 5, b
#define NCO2PWS1                         BANKMASK(NCO2CLK), 6, b
#define NCO2PWS2                         BANKMASK(NCO2CLK), 7, b
#define NCO3ACC0                         BANKMASK(NCO3ACCL), 0, b
#define NCO3ACC1                         BANKMASK(NCO3ACCL), 1, b
#define NCO3ACC10                        BANKMASK(NCO3ACCH), 2, b
#define NCO3ACC11                        BANKMASK(NCO3ACCH), 3, b
#define NCO3ACC12                        BANKMASK(NCO3ACCH), 4, b
#define NCO3ACC13                        BANKMASK(NCO3ACCH), 5, b
#define NCO3ACC14                        BANKMASK(NCO3ACCH), 6, b
#define NCO3ACC15                        BANKMASK(NCO3ACCH), 7, b
#define NCO3ACC16                        BANKMASK(NCO3ACCU), 0, b
#define NCO3ACC17                        BANKMASK(NCO3ACCU), 1, b
#define NCO3ACC18                        BANKMASK(NCO3ACCU), 2, b
#define NCO3ACC19                        BANKMASK(NCO3ACCU), 3, b
#define NCO3ACC2                         BANKMASK(NCO3ACCL), 2, b
#define NCO3ACC3                         BANKMASK(NCO3ACCL), 3, b
#define NCO3ACC4                         BANKMASK(NCO3ACCL), 4, b
#define NCO3ACC5                         BANKMASK(NCO3ACCL), 5, b
#define NCO3ACC6                         BANKMASK(NCO3ACCL), 6, b
#define NCO3ACC7                         BANKMASK(NCO3ACCL), 7, b
#define NCO3ACC8                         BANKMASK(NCO3ACCH), 0, b
#define NCO3ACC9                         BANKMASK(NCO3ACCH), 1, b
#define NCO3CKS0                         BANKMASK(NCO3CLK), 0, b
#define NCO3CKS1                         BANKMASK(NCO3CLK), 1, b
#define NCO3CKS2                         BANKMASK(NCO3CLK), 2, b
#define NCO3CKS3                         BANKMASK(NCO3CLK), 3, b
#define NCO3EN                           BANKMASK(NCO3CON), 7, b
#define NCO3IE                           BANKMASK(PIE14), 3, a
#define NCO3IF                           BANKMASK(PIR14), 3, a
#define NCO3INC0                         BANKMASK(NCO3INCL), 0, b
#define NCO3INC1                         BANKMASK(NCO3INCL), 1, b
#define NCO3INC10                        BANKMASK(NCO3INCH), 2, b
#define NCO3INC11                        BANKMASK(NCO3INCH), 3, b
#define NCO3INC12                        BANKMASK(NCO3INCH), 4, b
#define NCO3INC13                        BANKMASK(NCO3INCH), 5, b
#define NCO3INC14                        BANKMASK(NCO3INCH), 6, b
#define NCO3INC15                        BANKMASK(NCO3INCH), 7, b
#define NCO3INC16                        BANKMASK(NCO3INCU), 0, b
#define NCO3INC17                        BANKMASK(NCO3INCU), 1, b
#define NCO3INC18                        BANKMASK(NCO3INCU), 2, b
#define NCO3INC19                        BANKMASK(NCO3INCU), 3, b
#define NCO3INC2                         BANKMASK(NCO3INCL), 2, b
#define NCO3INC3                         BANKMASK(NCO3INCL), 3, b
#define NCO3INC4                         BANKMASK(NCO3INCL), 4, b
#define NCO3INC5                         BANKMASK(NCO3INCL), 5, b
#define NCO3INC6                         BANKMASK(NCO3INCL), 6, b
#define NCO3INC7                         BANKMASK(NCO3INCL), 7, b
#define NCO3INC8                         BANKMASK(NCO3INCH), 0, b
#define NCO3INC9                         BANKMASK(NCO3INCH), 1, b
#define NCO3IP                           BANKMASK(IPR14), 3, b
#define NCO3MD                           BANKMASK(PMD4), 2, b
#define NCO3OUT                          BANKMASK(NCO3CON), 5, b
#define NCO3PFM                          BANKMASK(NCO3CON), 0, b
#define NCO3POL                          BANKMASK(NCO3CON), 4, b
#define NCO3PWS0                         BANKMASK(NCO3CLK), 5, b
#define NCO3PWS1                         BANKMASK(NCO3CLK), 6, b
#define NCO3PWS2                         BANKMASK(NCO3CLK), 7, b
#define NCRCERR                          BANKMASK(C1BDIAG1U), 5, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NFORMERR                         BANKMASK(C1BDIAG1U), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_A                            BANKMASK(I2C1STAT0), 3, b
#define NOT_ADDRESS                      BANKMASK(I2C1STAT0), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, b
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_W                            BANKMASK(I2C1STAT0), 4, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(I2C1STAT0), 4, b
#define NREF0                            BANKMASK(ADREF), 4, b
#define NRERRCNT0                        BANKMASK(C1BDIAG0L), 0, b
#define NRERRCNT1                        BANKMASK(C1BDIAG0L), 1, b
#define NRERRCNT2                        BANKMASK(C1BDIAG0L), 2, b
#define NRERRCNT3                        BANKMASK(C1BDIAG0L), 3, b
#define NRERRCNT4                        BANKMASK(C1BDIAG0L), 4, b
#define NRERRCNT5                        BANKMASK(C1BDIAG0L), 5, b
#define NRERRCNT6                        BANKMASK(C1BDIAG0L), 6, b
#define NRERRCNT7                        BANKMASK(C1BDIAG0L), 7, b
#define NSS0                             BANKMASK(DAC1CON), 0, b
#define NSTUFERR                         BANKMASK(C1BDIAG1U), 4, b
#define NTERRCNT0                        BANKMASK(C1BDIAG0H), 0, b
#define NTERRCNT1                        BANKMASK(C1BDIAG0H), 1, b
#define NTERRCNT2                        BANKMASK(C1BDIAG0H), 2, b
#define NTERRCNT3                        BANKMASK(C1BDIAG0H), 3, b
#define NTERRCNT4                        BANKMASK(C1BDIAG0H), 4, b
#define NTERRCNT5                        BANKMASK(C1BDIAG0H), 5, b
#define NTERRCNT6                        BANKMASK(C1BDIAG0H), 6, b
#define NTERRCNT7                        BANKMASK(C1BDIAG0H), 7, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMIE                            BANKMASK(PIE15), 0, a
#define NVMIF                            BANKMASK(PIR15), 0, a
#define NVMIP                            BANKMASK(IPR15), 0, b
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define ODCF0                            BANKMASK(ODCONF), 0, b
#define ODCF1                            BANKMASK(ODCONF), 1, b
#define ODCF2                            BANKMASK(ODCONF), 2, b
#define ODCF3                            BANKMASK(ODCONF), 3, b
#define ODCF4                            BANKMASK(ODCONF), 4, b
#define ODCF5                            BANKMASK(ODCONF), 5, b
#define ODCF6                            BANKMASK(ODCONF), 6, b
#define ODCF7                            BANKMASK(ODCONF), 7, b
#define OE                               BANKMASK(CLCnCON), 6, b
#define OE0                              BANKMASK(DAC1CON), 4, b
#define OE1                              BANKMASK(DAC1CON), 5, b
#define OPMOD0                           BANKMASK(C1CONU), 5, b
#define OPMOD1                           BANKMASK(C1CONU), 6, b
#define OPMOD2                           BANKMASK(C1CONU), 7, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, b
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCIE                             BANKMASK(I2C1PIE), 2, b
#define PCIF                             BANKMASK(I2C1PIR), 2, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POR                              BANKMASK(PCON0), 1, a
#define PORT                             BANKMASK(INT0PPS), 3, b
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PR10                             BANKMASK(SMT1PRH), 2, b
#define PR11                             BANKMASK(SMT1PRH), 3, b
#define PR12                             BANKMASK(SMT1PRH), 4, b
#define PR13                             BANKMASK(SMT1PRH), 5, b
#define PR14                             BANKMASK(SMT1PRH), 6, b
#define PR15                             BANKMASK(SMT1PRH), 7, b
#define PR16                             BANKMASK(SMT1PRU), 0, b
#define PR17                             BANKMASK(SMT1PRU), 1, b
#define PR18                             BANKMASK(SMT1PRU), 2, b
#define PR19                             BANKMASK(SMT1PRU), 3, b
#define PR20                             BANKMASK(SMT1PRU), 4, b
#define PR21                             BANKMASK(SMT1PRU), 5, b
#define PR22                             BANKMASK(SMT1PRU), 6, b
#define PR23                             BANKMASK(SMT1PRU), 7, b
#define PR3                              BANKMASK(SMT1PRL), 3, b
