GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
#define REPEAT                           BANKMASK(SMT1CON1), 6, b
#define REQOP0                           BANKMASK(C1CONT), 0, b
#define REQOP1                           BANKMASK(C1CONT), 1, b
#define REQOP2                           BANKMASK(C1CONT), 2, b
#define RERRCNT0                         BANKMASK(C1TRECL), 0, b
#define RERRCNT1                         BANKMASK(C1TRECL), 1, b
#define RERRCNT2                         BANKMASK(C1TRECL), 2, b
#define RERRCNT3                         BANKMASK(C1TRECL), 3, b
#define RERRCNT4                         BANKMASK(C1TRECL), 4, b
#define RERRCNT5                         BANKMASK(C1TRECL), 5, b
#define RERRCNT6                         BANKMASK(C1TRECL), 6, b
#define RERRCNT7                         BANKMASK(C1TRECL), 7, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RF0                              BANKMASK(PORTF), 0, a
#define RF0PPS0                          BANKMASK(RF0PPS), 0, b
#define RF0PPS1                          BANKMASK(RF0PPS), 1, b
#define RF0PPS2                          BANKMASK(RF0PPS), 2, b
#define RF0PPS3                          BANKMASK(RF0PPS), 3, b
#define RF0PPS4                          BANKMASK(RF0PPS), 4, b
#define RF0PPS5                          BANKMASK(RF0PPS), 5, b
#define RF1                              BANKMASK(PORTF), 1, a
#define RF1PPS0                          BANKMASK(RF1PPS), 0, b
#define RF1PPS1                          BANKMASK(RF1PPS), 1, b
#define RF1PPS2                          BANKMASK(RF1PPS), 2, b
#define RF1PPS3                          BANKMASK(RF1PPS), 3, b
#define RF1PPS4                          BANKMASK(RF1PPS), 4, b
#define RF1PPS5                          BANKMASK(RF1PPS), 5, b
#define RF2                              BANKMASK(PORTF), 2, a
#define RF2PPS0                          BANKMASK(RF2PPS), 0, b
#define RF2PPS1                          BANKMASK(RF2PPS), 1, b
#define RF2PPS2                          BANKMASK(RF2PPS), 2, b
#define RF2PPS3                          BANKMASK(RF2PPS), 3, b
#define RF2PPS4                          BANKMASK(RF2PPS), 4, b
#define RF2PPS5                          BANKMASK(RF2PPS), 5, b
#define RF3                              BANKMASK(PORTF), 3, a
#define RF3PPS0                          BANKMASK(RF3PPS), 0, b
#define RF3PPS1                          BANKMASK(RF3PPS), 1, b
#define RF3PPS2                          BANKMASK(RF3PPS), 2, b
#define RF3PPS3                          BANKMASK(RF3PPS), 3, b
#define RF3PPS4                          BANKMASK(RF3PPS), 4, b
#define RF3PPS5                          BANKMASK(RF3PPS), 5, b
#define RF4                              BANKMASK(PORTF), 4, a
#define RF4PPS0                          BANKMASK(RF4PPS), 0, b
#define RF4PPS1                          BANKMASK(RF4PPS), 1, b
#define RF4PPS2                          BANKMASK(RF4PPS), 2, b
#define RF4PPS3                          BANKMASK(RF4PPS), 3, b
#define RF4PPS4                          BANKMASK(RF4PPS), 4, b
#define RF4PPS5                          BANKMASK(RF4PPS), 5, b
#define RF5                              BANKMASK(PORTF), 5, a
#define RF5PPS0                          BANKMASK(RF5PPS), 0, b
#define RF5PPS1                          BANKMASK(RF5PPS), 1, b
#define RF5PPS2                          BANKMASK(RF5PPS), 2, b
#define RF5PPS3                          BANKMASK(RF5PPS), 3, b
#define RF5PPS4                          BANKMASK(RF5PPS), 4, b
#define RF5PPS5                          BANKMASK(RF5PPS), 5, b
#define RF6                              BANKMASK(PORTF), 6, a
#define RF6PPS0                          BANKMASK(RF6PPS), 0, b
#define RF6PPS1                          BANKMASK(RF6PPS), 1, b
#define RF6PPS2                          BANKMASK(RF6PPS), 2, b
#define RF6PPS3                          BANKMASK(RF6PPS), 3, b
#define RF6PPS4                          BANKMASK(RF6PPS), 4, b
#define RF6PPS5                          BANKMASK(RF6PPS), 5, b
#define RF7                              BANKMASK(PORTF), 7, a
#define RF7PPS0                          BANKMASK(RF7PPS), 0, b
#define RF7PPS1                          BANKMASK(RF7PPS), 1, b
#define RF7PPS2                          BANKMASK(RF7PPS), 2, b
#define RF7PPS3                          BANKMASK(RF7PPS), 3, b
#define RF7PPS4                          BANKMASK(RF7PPS), 4, b
#define RF7PPS5                          BANKMASK(RF7PPS), 5, b
#define RFIF1                            BANKMASK(C1RXIFL), 1, b
#define RFIF10                           BANKMASK(C1RXIFH), 2, b
#define RFIF11                           BANKMASK(C1RXIFH), 3, b
#define RFIF12                           BANKMASK(C1RXIFH), 4, b
#define RFIF13                           BANKMASK(C1RXIFH), 5, b
#define RFIF14                           BANKMASK(C1RXIFH), 6, b
#define RFIF15                           BANKMASK(C1RXIFH), 7, b
#define RFIF16                           BANKMASK(C1RXIFU), 0, b
#define RFIF17                           BANKMASK(C1RXIFU), 1, b
#define RFIF18                           BANKMASK(C1RXIFU), 2, b
#define RFIF19                           BANKMASK(C1RXIFU), 3, b
#define RFIF2                            BANKMASK(C1RXIFL), 2, b
#define RFIF20                           BANKMASK(C1RXIFU), 4, b
#define RFIF21                           BANKMASK(C1RXIFU), 5, b
#define RFIF22                           BANKMASK(C1RXIFU), 6, b
#define RFIF23                           BANKMASK(C1RXIFU), 7, b
#define RFIF24                           BANKMASK(C1RXIFT), 0, b
#define RFIF25                           BANKMASK(C1RXIFT), 1, b
#define RFIF26                           BANKMASK(C1RXIFT), 2, b
#define RFIF27                           BANKMASK(C1RXIFT), 3, b
#define RFIF28                           BANKMASK(C1RXIFT), 4, b
#define RFIF29                           BANKMASK(C1RXIFT), 5, b
#define RFIF3                            BANKMASK(C1RXIFL), 3, b
#define RFIF30                           BANKMASK(C1RXIFT), 6, b
#define RFIF31                           BANKMASK(C1RXIFT), 7, b
#define RFIF4                            BANKMASK(C1RXIFL), 4, b
#define RFIF5                            BANKMASK(C1RXIFL), 5, b
#define RFIF6                            BANKMASK(C1RXIFL), 6, b
#define RFIF7                            BANKMASK(C1RXIFL), 7, b
#define RFIF8                            BANKMASK(C1RXIFH), 0, b
#define RFIF9                            BANKMASK(C1RXIFH), 1, b
#define RFOVIF1                          BANKMASK(C1RXOVIFL), 1, b
#define RFOVIF10                         BANKMASK(C1RXOVIFH), 2, b
#define RFOVIF11                         BANKMASK(C1RXOVIFH), 3, b
#define RFOVIF12                         BANKMASK(C1RXOVIFH), 4, b
#define RFOVIF13                         BANKMASK(C1RXOVIFH), 5, b
#define RFOVIF14                         BANKMASK(C1RXOVIFH), 6, b
#define RFOVIF15                         BANKMASK(C1RXOVIFH), 7, b
#define RFOVIF16                         BANKMASK(C1RXOVIFU), 0, b
#define RFOVIF17                         BANKMASK(C1RXOVIFU), 1, b
#define RFOVIF18                         BANKMASK(C1RXOVIFU), 2, b
#define RFOVIF19                         BANKMASK(C1RXOVIFU), 3, b
#define RFOVIF2                          BANKMASK(C1RXOVIFL), 2, b
#define RFOVIF20                         BANKMASK(C1RXOVIFU), 4, b
#define RFOVIF21                         BANKMASK(C1RXOVIFU), 5, b
#define RFOVIF22                         BANKMASK(C1RXOVIFU), 6, b
#define RFOVIF23                         BANKMASK(C1RXOVIFU), 7, b
#define RFOVIF24                         BANKMASK(C1RXOVIFT), 0, b
#define RFOVIF25                         BANKMASK(C1RXOVIFT), 1, b
#define RFOVIF26                         BANKMASK(C1RXOVIFT), 2, b
#define RFOVIF27                         BANKMASK(C1RXOVIFT), 3, b
#define RFOVIF28                         BANKMASK(C1RXOVIFT), 4, b
#define RFOVIF29                         BANKMASK(C1RXOVIFT), 5, b
#define RFOVIF3                          BANKMASK(C1RXOVIFL), 3, b
#define RFOVIF30                         BANKMASK(C1RXOVIFT), 6, b
#define RFOVIF31                         BANKMASK(C1RXOVIFT), 7, b
#define RFOVIF4                          BANKMASK(C1RXOVIFL), 4, b
#define RFOVIF5                          BANKMASK(C1RXOVIFL), 5, b
#define RFOVIF6                          BANKMASK(C1RXOVIFL), 6, b
#define RFOVIF7                          BANKMASK(C1RXOVIFL), 7, b
#define RFOVIF8                          BANKMASK(C1RXOVIFH), 0, b
#define RFOVIF9                          BANKMASK(C1RXOVIFH), 1, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSCIE                            BANKMASK(I2C1PIE), 1, b
#define RSCIF                            BANKMASK(I2C1PIR), 1, b
#define RSEN                             BANKMASK(I2C1CON0), 6, b
#define RST                              BANKMASK(SMT1STAT), 5, b
#define RTXAT                            BANKMASK(C1CONU), 0, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RXBP                             BANKMASK(C1TRECU), 3, b
#define RXIE                             BANKMASK(C1INTU), 1, b
#define RXIF                             BANKMASK(C1INTL), 1, b
#define RXO                              BANKMASK(I2C1CON1), 2, b
#define RXWARN                           BANKMASK(C1TRECU), 1, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCIE                             BANKMASK(I2C1PIE), 0, b
#define SCIF                             BANKMASK(I2C1PIR), 0, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SDAHT0                           BANKMASK(I2C1CON2), 2, b
#define SDAHT1                           BANKMASK(I2C1CON2), 3, b
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SERR2LOM                         BANKMASK(C1CONU), 2, b
#define SERRIE                           BANKMASK(C1INTT), 4, b
#define SERRIF                           BANKMASK(C1INTH), 4, b
#define SETUP0                           BANKMASK(CRCCON0), 2, b
#define SETUP1                           BANKMASK(CRCCON0), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHIFT0                           BANKMASK(CRCSHFTL), 0, b
#define SHIFT1                           BANKMASK(CRCSHFTL), 1, b
#define SHIFT10                          BANKMASK(CRCSHFTH), 2, b
#define SHIFT11                          BANKMASK(CRCSHFTH), 3, b
#define SHIFT12                          BANKMASK(CRCSHFTH), 4, b
#define SHIFT13                          BANKMASK(CRCSHFTH), 5, b
#define SHIFT14                          BANKMASK(CRCSHFTH), 6, b
#define SHIFT15                          BANKMASK(CRCSHFTH), 7, b
#define SHIFT16                          BANKMASK(CRCSHFTU), 0, b
#define SHIFT17                          BANKMASK(CRCSHFTU), 1, b
#define SHIFT18                          BANKMASK(CRCSHFTU), 2, b
#define SHIFT19                          BANKMASK(CRCSHFTU), 3, b
#define SHIFT2                           BANKMASK(CRCSHFTL), 2, b
#define SHIFT20                          BANKMASK(CRCSHFTU), 4, b
#define SHIFT21                          BANKMASK(CRCSHFTU), 5, b
#define SHIFT22                          BANKMASK(CRCSHFTU), 6, b
#define SHIFT23                          BANKMASK(CRCSHFTU), 7, b
#define SHIFT24                          BANKMASK(CRCSHFTT), 0, b
#define SHIFT25                          BANKMASK(CRCSHFTT), 1, b
#define SHIFT26                          BANKMASK(CRCSHFTT), 2, b
#define SHIFT27                          BANKMASK(CRCSHFTT), 3, b
#define SHIFT28                          BANKMASK(CRCSHFTT), 4, b
#define SHIFT29                          BANKMASK(CRCSHFTT), 5, b
#define SHIFT3                           BANKMASK(CRCSHFTL), 3, b
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SID11EN                          BANKMASK(C1TDCT), 0, b
#define SIDL                             BANKMASK(C1CONH), 5, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQ7                            BANKMASK(DMAnSIRQ), 7, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SJW4                             BANKMASK(C1NBTCFGL), 4, b
#define SJW5                             BANKMASK(C1NBTCFGL), 5, b
#define SJW6                             BANKMASK(C1NBTCFGL), 6, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SLRF0                            BANKMASK(SLRCONF), 0, b
#define SLRF1                            BANKMASK(SLRCONF), 1, b
#define SLRF2                            BANKMASK(SLRCONF), 2, b
#define SLRF3                            BANKMASK(SLRCONF), 3, b
#define SLRF4                            BANKMASK(SLRCONF), 4, b
#define SLRF5                            BANKMASK(SLRCONF), 5, b
#define SLRF6                            BANKMASK(SLRCONF), 6, b
#define SLRF7                            BANKMASK(SLRCONF), 7, b
#define SMA                              BANKMASK(I2C1STAT0), 6, b
#define SMT1AS                           BANKMASK(SMT1STAT), 0, b
#define SMT1CPOL                         BANKMASK(SMT1CON0), 2, b
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0, b
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1, b
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2, b
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3, b
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4, b
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5, b
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6, b
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7, b
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0, b
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1, b
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2, b
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3, b
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2, b
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4, b
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5, b
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6, b
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7, b
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3, b
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4, b
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5, b
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6, b
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
