GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1EN                           BANKMASK(SMT1CON0), 7, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE1), 5, a
#define SMT1IF                           BANKMASK(PIR1), 5, a
#define SMT1IP                           BANKMASK(IPR1), 5, b
#define SMT1MD                           BANKMASK(PMD1), 7, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE1), 6, a
#define SMT1PRAIF                        BANKMASK(PIR1), 6, a
#define SMT1PRAIP                        BANKMASK(IPR1), 6, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE1), 7, a
#define SMT1PWAIF                        BANKMASK(PIR1), 7, a
#define SMT1PWAIP                        BANKMASK(IPR1), 7, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1RST                          BANKMASK(SMT1STAT), 5, b
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0, b
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1, b
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2, b
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3, b
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4, b
#define SMT1SIGPPS5                      BANKMASK(SMT1SIGPPS), 5, b
#define SMT1SPOL                         BANKMASK(SMT1CON0), 3, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1STP                          BANKMASK(SMT1CON0), 5, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0, b
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1, b
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2, b
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3, b
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4, b
#define SMT1WINPPS5                      BANKMASK(SMT1WINPPS), 5, b
#define SMT1WOL                          BANKMASK(SMT1CON0), 4, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLKSEL4                      BANKMASK(SPI1CLK), 4, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
#define SPI1IF                           BANKMASK(PIR3), 2, a
#define SPI1IP                           BANKMASK(IPR3), 2, b
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD6), 1, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE3), 0, a
#define SPI1RXIF                         BANKMASK(PIR3), 0, a
#define SPI1RXIP                         BANKMASK(IPR3), 0, b
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE3), 1, a
#define SPI1TXIF                         BANKMASK(PIR3), 1, a
#define SPI1TXIP                         BANKMASK(IPR3), 1, b
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPI2BMODE                        BANKMASK(SPI2CON0), 0, b
#define SPI2BUSY                         BANKMASK(SPI2CON2), 7, b
#define SPI2CKE                          BANKMASK(SPI2CON1), 6, b
#define SPI2CKP                          BANKMASK(SPI2CON1), 5, b
#define SPI2CLKSEL0                      BANKMASK(SPI2CLK), 0, b
#define SPI2CLKSEL1                      BANKMASK(SPI2CLK), 1, b
#define SPI2CLKSEL2                      BANKMASK(SPI2CLK), 2, b
#define SPI2CLKSEL3                      BANKMASK(SPI2CLK), 3, b
#define SPI2CLKSEL4                      BANKMASK(SPI2CLK), 4, b
#define SPI2CLRBF                        BANKMASK(SPI2STATUS), 2, b
#define SPI2EOSIE                        BANKMASK(SPI2INTE), 4, b
#define SPI2EOSIF                        BANKMASK(SPI2INTF), 4, b
#define SPI2FST                          BANKMASK(SPI2CON1), 4, b
#define SPI2IE                           BANKMASK(PIE5), 2, a
#define SPI2IF                           BANKMASK(PIR5), 2, a
#define SPI2IP                           BANKMASK(IPR5), 2, b
#define SPI2LSBF                         BANKMASK(SPI2CON0), 2, b
#define SPI2MD                           BANKMASK(PMD6), 2, b
#define SPI2MST                          BANKMASK(SPI2CON0), 1, b
#define SPI2RXBF                         BANKMASK(SPI2STATUS), 0, b
#define SPI2RXIE                         BANKMASK(PIE5), 0, a
#define SPI2RXIF                         BANKMASK(PIR5), 0, a
#define SPI2RXIP                         BANKMASK(IPR5), 0, b
#define SPI2RXOIE                        BANKMASK(SPI2INTE), 2, b
#define SPI2RXOIF                        BANKMASK(SPI2INTF), 2, b
#define SPI2RXR                          BANKMASK(SPI2CON2), 0, b
#define SPI2RXRE                         BANKMASK(SPI2STATUS), 3, b
#define SPI2SCKPPS0                      BANKMASK(SPI2SCKPPS), 0, b
#define SPI2SCKPPS1                      BANKMASK(SPI2SCKPPS), 1, b
#define SPI2SCKPPS2                      BANKMASK(SPI2SCKPPS), 2, b
#define SPI2SCKPPS3                      BANKMASK(SPI2SCKPPS), 3, b
#define SPI2SCKPPS4                      BANKMASK(SPI2SCKPPS), 4, b
#define SPI2SDIP                         BANKMASK(SPI2CON1), 1, b
#define SPI2SDIPPS0                      BANKMASK(SPI2SDIPPS), 0, b
#define SPI2SDIPPS1                      BANKMASK(SPI2SDIPPS), 1, b
#define SPI2SDIPPS2                      BANKMASK(SPI2SDIPPS), 2, b
#define SPI2SDIPPS3                      BANKMASK(SPI2SDIPPS), 3, b
#define SPI2SDIPPS4                      BANKMASK(SPI2SDIPPS), 4, b
#define SPI2SDOP                         BANKMASK(SPI2CON1), 0, b
#define SPI2SMP                          BANKMASK(SPI2CON1), 7, b
#define SPI2SOSIE                        BANKMASK(SPI2INTE), 5, b
#define SPI2SOSIF                        BANKMASK(SPI2INTF), 5, b
#define SPI2SPIEN                        BANKMASK(SPI2CON0), 7, b
#define SPI2SRMTIE                       BANKMASK(SPI2INTE), 7, b
#define SPI2SRMTIF                       BANKMASK(SPI2INTF), 7, b
#define SPI2SSET                         BANKMASK(SPI2CON2), 2, b
#define SPI2SSFLT                        BANKMASK(SPI2CON2), 6, b
#define SPI2SSP                          BANKMASK(SPI2CON1), 2, b
#define SPI2SSPPS0                       BANKMASK(SPI2SSPPS), 0, b
#define SPI2SSPPS1                       BANKMASK(SPI2SSPPS), 1, b
#define SPI2SSPPS2                       BANKMASK(SPI2SSPPS), 2, b
#define SPI2SSPPS3                       BANKMASK(SPI2SSPPS), 3, b
#define SPI2SSPPS4                       BANKMASK(SPI2SSPPS), 4, b
#define SPI2TCZIE                        BANKMASK(SPI2INTE), 6, b
#define SPI2TCZIF                        BANKMASK(SPI2INTF), 6, b
#define SPI2TXBE                         BANKMASK(SPI2STATUS), 5, b
#define SPI2TXIE                         BANKMASK(PIE5), 1, a
#define SPI2TXIF                         BANKMASK(PIR5), 1, a
#define SPI2TXIP                         BANKMASK(IPR5), 1, b
#define SPI2TXR                          BANKMASK(SPI2CON2), 1, b
#define SPI2TXUIE                        BANKMASK(SPI2INTE), 1, b
#define SPI2TXUIF                        BANKMASK(SPI2INTF), 1, b
#define SPI2TXWE                         BANKMASK(SPI2STATUS), 7, b
#define SPOL                             BANKMASK(SMT1CON0), 3, b
#define SPTR0                            BANKMASK(DMAnSPTRL), 0, b
#define SPTR1                            BANKMASK(DMAnSPTRL), 1, b
#define SPTR10                           BANKMASK(DMAnSPTRH), 2, b
#define SPTR11                           BANKMASK(DMAnSPTRH), 3, b
#define SPTR12                           BANKMASK(DMAnSPTRH), 4, b
#define SPTR13                           BANKMASK(DMAnSPTRH), 5, b
#define SPTR14                           BANKMASK(DMAnSPTRH), 6, b
#define SPTR15                           BANKMASK(DMAnSPTRH), 7, b
#define SPTR16                           BANKMASK(DMAnSPTRU), 0, b
#define SPTR17                           BANKMASK(DMAnSPTRU), 1, b
#define SPTR18                           BANKMASK(DMAnSPTRU), 2, b
#define SPTR19                           BANKMASK(DMAnSPTRU), 3, b
#define SPTR2                            BANKMASK(DMAnSPTRL), 2, b
#define SPTR20                           BANKMASK(DMAnSPTRU), 4, b
#define SPTR21                           BANKMASK(DMAnSPTRU), 5, b
#define SPTR3                            BANKMASK(DMAnSPTRL), 3, b
#define SPTR4                            BANKMASK(DMAnSPTRL), 4, b
#define SPTR5                            BANKMASK(DMAnSPTRL), 5, b
#define SPTR6                            BANKMASK(DMAnSPTRL), 6, b
#define SPTR7                            BANKMASK(DMAnSPTRL), 7, b
#define SPTR8                            BANKMASK(DMAnSPTRH), 0, b
#define SPTR9                            BANKMASK(DMAnSPTRH), 1, b
#define SSA0                             BANKMASK(DMAnSSAL), 0, b
#define SSA1                             BANKMASK(DMAnSSAL), 1, b
#define SSA10                            BANKMASK(DMAnSSAH), 2, b
#define SSA11                            BANKMASK(DMAnSSAH), 3, b
#define SSA12                            BANKMASK(DMAnSSAH), 4, b
#define SSA13                            BANKMASK(DMAnSSAH), 5, b
#define SSA14                            BANKMASK(DMAnSSAH), 6, b
#define SSA15                            BANKMASK(DMAnSSAH), 7, b
#define SSA16                            BANKMASK(DMAnSSAU), 0, b
#define SSA17                            BANKMASK(DMAnSSAU), 1, b
#define SSA18                            BANKMASK(DMAnSSAU), 2, b
#define SSA19                            BANKMASK(DMAnSSAU), 3, b
#define SSA2                             BANKMASK(DMAnSSAL), 2, b
#define SSA20                            BANKMASK(DMAnSSAU), 4, b
#define SSA21                            BANKMASK(DMAnSSAU), 5, b
#define SSA3                             BANKMASK(DMAnSSAL), 3, b
#define SSA4                             BANKMASK(DMAnSSAL), 4, b
#define SSA5                             BANKMASK(DMAnSSAL), 5, b
#define SSA6                             BANKMASK(DMAnSSAL), 6, b
#define SSA7                             BANKMASK(DMAnSSAL), 7, b
#define SSA8                             BANKMASK(DMAnSSAH), 0, b
#define SSA9                             BANKMASK(DMAnSSAH), 1, b
#define SSEL0                            BANKMASK(SMT1SIG), 0, b
#define SSEL1                            BANKMASK(SMT1SIG), 1, b
#define SSEL2                            BANKMASK(SMT1SIG), 2, b
#define SSEL3                            BANKMASK(SMT1SIG), 3, b
#define SSEL4                            BANKMASK(SMT1SIG), 4, b
#define SSTP                             BANKMASK(DMAnCON1), 0, b
#define SSZ0                             BANKMASK(DMAnSSZL), 0, b
#define SSZ1                             BANKMASK(DMAnSSZL), 1, b
#define SSZ10                            BANKMASK(DMAnSSZH), 2, b
#define SSZ11                            BANKMASK(DMAnSSZH), 3, b
#define SSZ2                             BANKMASK(DMAnSSZL), 2, b
#define SSZ3                             BANKMASK(DMAnSSZL), 3, b
#define SSZ4                             BANKMASK(DMAnSSZL), 4, b
#define SSZ5                             BANKMASK(DMAnSSZL), 5, b
#define SSZ6                             BANKMASK(DMAnSSZL), 6, b
#define SSZ7                             BANKMASK(DMAnSSZL), 7, b
#define SSZ8                             BANKMASK(DMAnSSZH), 0, b
#define SSZ9                             BANKMASK(DMAnSSZH), 1, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STEF                             BANKMASK(C1CONU), 3, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STP                              BANKMASK(SMT1CON0), 5, b
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, a
#define SWIF                             BANKMASK(PIR0), 0, a
#define SWIP                             BANKMASK(IPR0), 0, b
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, b
#define T0ASYNC                          BANKMASK(T0CON1), 4, b
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4, b
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, b
#define T0CKPS1                          BANKMASK(T0CON1), 1, b
