GopalSaraf/Practicals/PSDL/include/proc/pic18f56q84.inc
#define ZCDMD                            BANKMASK(PMD3), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec,lowdata
psect udata_bank16,class=BANK16,space=SPACE_DATA,noexec
psect udata_bank17,class=BANK17,space=SPACE_DATA,noexec
psect udata_bank18,class=BANK18,space=SPACE_DATA,noexec
psect udata_bank19,class=BANK19,space=SPACE_DATA,noexec
psect udata_bank20,class=BANK20,space=SPACE_DATA,noexec
psect udata_bank21,class=BANK21,space=SPACE_DATA,noexec
psect udata_bank22,class=BANK22,space=SPACE_DATA,noexec
psect udata_bank23,class=BANK23,space=SPACE_DATA,noexec
psect udata_bank24,class=BANK24,space=SPACE_DATA,noexec
psect udata_bank25,class=BANK25,space=SPACE_DATA,noexec
psect udata_bank26,class=BANK26,space=SPACE_DATA,noexec
psect udata_bank27,class=BANK27,space=SPACE_DATA,noexec
psect udata_bank28,class=BANK28,space=SPACE_DATA,noexec
psect udata_bank29,class=BANK29,space=SPACE_DATA,noexec
psect udata_bank30,class=BANK30,space=SPACE_DATA,noexec
psect udata_bank31,class=BANK31,space=SPACE_DATA,noexec
psect udata_bank32,class=BANK32,space=SPACE_DATA,noexec
psect udata_bank33,class=BANK33,space=SPACE_DATA,noexec
psect udata_bank34,class=BANK34,space=SPACE_DATA,noexec
psect udata_bank35,class=BANK35,space=SPACE_DATA,noexec
psect udata_bank36,class=BANK36,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F56Q84_INC_
